{
    "listName" : "Forbes Asia’s 200 Best Under A Billion'",
    "listCode":"Forbes_Under_A_Billion_Asia_2024",
    "listSubHeading" :"AUGUST 06, 2024",
    "listCompanies": [
        {
            "Rank": 1,
            "Company": "Able Global",
            "Country/Territory": "Malaysia",
            "TICKER": "ABLEGLOB.KL",
            "Industry": "Consumer Goods",
            "Sales ($M)": 142,
            "Net Income ($M)": 11,
            "Market Value ($M)": 134,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Able Global Berhad is a Malaysian investment holding company that operates in two main segments: Tin Cans and Milk Products. The Tin Cans segment is involved in the manufacturing and trading of various types of tin cans, while the Milk Products segment focuses on the manufacturing and sale of milk and other related dairy products. The company has a significant presence in the food and beverage industry, with a particular emphasis on condensed and evaporated milk. [highlight]The company changed its name from Johore Tin Berhad to Able Global Berhad in 2021 to better reflect its diversified business operations.[/highlight]",
                "insider_ownership": "[pos]Insider ownership is very high at approximately 47%, with the founding Goh family holding a controlling stake.[/pos] This indicates a strong alignment of interests between management and shareholders. [link to Ainvest Able Global Ownership](https://ainvest.com/stock/klse-7127/able-global-berhad/ownership)",
                "balancesheet": "As of the latest financial reports, Able Global has total assets of RM 787.0M and total debt of RM 223.6M. [pos]The company maintains a healthy cash position with RM 132.8M in cash and short-term investments.[/pos] [neg]The debt-to-equity ratio is 45.4%, which is a key consideration for a potential acquirer.[/neg] [link to Simply Wall St Able Global Financial Health](https://simplywall.st/stocks/my/consumer-staples/klse-ableglob/able-global-berhad/health)"
            }
        },
        {
            "Rank": 2,
            "Company": "Acrow",
            "Country/Territory": "Australia",
            "Ticker": "ACF.AX",
            "Industry": "Industrials",
            "Sales ($M)": 113,
            "Net Income ($M)": 16,
            "Market Value ($M)": 126,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Acrow is a leading provider of engineered formwork and scaffolding systems in Australia. The company offers a wide range of products and services to the construction industry, including the design, hire, and sale of formwork and scaffolding solutions. [highlight]Acrow has a strong reputation for quality and safety, and its products are used in a variety of major construction projects across the country.[/highlight]",
                "insider_ownership": "[pos]Insider ownership at Acrow is significant, with directors and key management personnel holding a substantial number of shares.[/pos] Recent on-market purchases by directors further demonstrate their confidence in the company's future prospects. [link to TipRanks Acrow Insider Trading](https://www.tipranks.com/au/stocks/asx/acf/insider-trading)",
                "balancesheet": "Acrow maintains a strong balance sheet with a healthy cash position and manageable debt levels. The company's financial reports indicate a solid track record of profitability and cash flow generation. [link to Acrow Investor Relations](https://www.acrow.com.au/investor-centre/)"
            }
        },
        {
            "Rank": 3,
            "Company": "Action Construction Equipment",
            "Country/Territory": "India",
            "Ticker": "ACE.NS",
            "Industry": "Industrials",
            "Sales ($M)": 352,
            "Net Income ($M)": 40,
            "Market Value ($M)": 425,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Action Construction Equipment (ACE) is a leading Indian manufacturer of construction and material handling equipment. The company's product portfolio includes cranes, loaders, and other heavy machinery. [highlight]ACE is a dominant player in the Indian market and has a strong reputation for its quality products and after-sales service.[/highlight]",
                "insider_ownership": "[pos]Promoter and promoter group holding in ACE is high at 65.41% as of March 2025.[/pos] This indicates a strong alignment of interests between the founding family and shareholders. [link to Trendlyne Action Construction Equipment Shareholding](https://trendlyne.com/equity/share-holding/101/ACE/latest/action-construction-equipment-ltd/)",
                "balancesheet": "ACE has a strong balance sheet with a healthy financial position. The company has consistently reported strong revenue growth and profitability. [link to Moneycontrol Action Construction Equipment Financials](https://www.moneycontrol.com/financials/actionconstructionequipment/balance-sheet/ACE)"
            }
        },
        {
            "Rank": 4,
            "Company": "Activation Group Holdings",
            "Country/Territory": "China",
            "Ticker": "9919.HK",
            "Industry": "Media & Entertainment",
            "Sales ($M)": 137,
            "Net Income ($M)": 15,
            "Market Value ($M)": 134,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Activation Group Holdings is a leading marketing and events company in Greater China, specializing in providing experiential marketing, digital and brand communication, and public relations services to a wide range of international and domestic clients. [highlight]The company has a strong focus on the luxury and premium brand sectors, and has a track record of executing high-profile events and campaigns.[/highlight]",
                "insider_ownership": "[neg]Insider ownership information is conflicting. While some sources report a high insider ownership of around 42%, more recent data from June 2025 suggests it is 0.00%.[/neg] However, it is worth noting that the Joint Chairman & CEO recently purchased a significant number of shares. [link to iTiger Activation Group Holdings Insider Trading](https://itiger.com/news/9919.HK/insider)",
                "balancesheet": "The company has a solid balance sheet with a history of revenue and profit growth. Financial reports are available on the Hong Kong Stock Exchange website. [link to HKEX News Activation Group Holdings Financials](https://www.hkexnews.hk/listedco/listconews/sehk/2024/0311/2024031100269.pdf)"
            }
        },
        {
            "Rank": 5,
            "Company": "Agi Infra",
            "Country/Territory": "India",
            "Ticker": "AGIIL.NS",
            "Industry": "Real Estate",
            "Sales ($M)": 35,
            "Net Income ($M)": 6,
            "Market Value ($M)": 126,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "AGI Infra is a real estate development company based in Jalandhar, India. The company is primarily focused on the development and sale of residential and commercial properties. [highlight]AGI Infra has a strong presence in the Punjab region and is known for its quality construction and timely project delivery.[/highlight]",
                "insider_ownership": "[pos]Insider ownership in AGI Infra is extremely high, with individual insiders holding 83% of the company.[/pos] The CEO, S. Sukhdev Khinda, is the largest shareholder with a 45% stake. This indicates a very strong alignment of interests between the management and shareholders. [link to Simply Wall St AGI Infra Ownership](https://simplywall.st/stocks/in/real-estate/nse-agiinfra/agi-infra-shares/ownership)",
                "balancesheet": "AGI Infra has a solid financial track record with consistent revenue and profit growth. The company has a healthy balance sheet with a low debt-to-equity ratio. [link to Equitymaster AGI Infra Financials](https://www.equitymaster.com/research-it/company-info/AGIINFRA/AGI-Infra-Ltd-Financial-Statement)"
            }
        },
        {
            "Rank": 6,
            "Company": "Ahluwalia Contracts (India)",
            "Country/Territory": "India",
            "Ticker": "AHLUCONT.NS",
            "Industry": "Construction",
            "Sales ($M)": 466,
            "Net Income ($M)": 45,
            "Market Value ($M)": 425,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Ahluwalia Contracts (India) Ltd. is a leading engineering and construction company in India. The company undertakes a wide range of projects, including residential and commercial buildings, institutional buildings, and infrastructure projects. [highlight]Ahluwalia Contracts has a strong track record of completing projects on time and within budget, and has a reputation for quality and reliability.[/highlight]",
                "insider_ownership": "[pos]Promoter holding in Ahluwalia Contracts is high at 55.32% as of March 2025.[/pos] This indicates a strong commitment from the promoters to the long-term success of the company. [link to Trendlyne Ahluwalia Contracts Shareholding](https://trendlyne.com/equity/share-holding/13/AHLUCONT/latest/ahluwalia-contracts-india-ltd/)",
                "balancesheet": "Ahluwalia Contracts has a robust balance sheet with a healthy order book, providing strong revenue visibility. The company has a consistent track record of profitability and cash flow generation. [link to Moneycontrol Ahluwalia Contracts Financials](https://www.moneycontrol.com/financial-statements/ahluwaliacontractsindia/balance-sheet/ACI05)"
            }
        },
        {
            "Rank": 7,
            "Company": "AIC",
            "Country/Territory": "Taiwan",
            "Ticker": "3693.TWO",
            "Industry": "Technology",
            "Sales ($M)": 282,
            "Net Income ($M)": 30,
            "Market Value ($M)": 1000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "AIC Inc. is a Taiwanese company that specializes in server and storage solutions. The company provides a wide range of products, including rackmount chassis, storage servers, and solutions for data centers. [highlight]AIC has a strong focus on research and development, and is known for its innovative and high-quality products.[/highlight]",
                "insider_ownership": "[neg]Specific information on insider ownership is not readily available.[/neg]",
                "balancesheet": "AIC has a strong financial position with a solid track record of revenue and profit growth. The company's financial statements are available on the Taipei Exchange (TPEX) website. [link to Investing.com AIC Financials](https://www.investing.com/pro/3693/financials)"
            }
        },
        {
            "Rank": 8,
            "Company": "Aidma Holdings",
            "Country/Territory": "Japan",
            "Ticker": "7373.T",
            "Industry": "Services",
            "Sales ($M)": 65,
            "Net Income ($M)": 9,
            "Market Value ($M)": 102,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Aidma Holdings is a Japanese company that provides sales support and marketing services to businesses. The company offers a range of services, including sales outsourcing, sales training, and marketing consulting. [highlight]Aidma has a strong focus on using technology to improve sales efficiency and effectiveness.[/highlight]",
                "insider_ownership": "[pos]Insider ownership at Aidma Holdings is very high, with the Representative Director, Yohei Miura, holding a 25.36% stake and JPM Co., Ltd. holding 39.24% of the shares.[/pos] This indicates a strong alignment of interests between the management and major shareholders. [link to J-Lic Aidma Holdings Major Shareholders](https://www.j-lic.com/english/listed_company/7373)",
                "balancesheet": "Aidma Holdings has a solid financial position with a history of revenue and profit growth. The company's financial statements are available on its investor relations website. [link to Aidma Holdings Investor Relations](https://www.aidma-hd.jp/ir)"
            }
        },
        {
            "Rank": 9,
            "Company": "Airtac International Group",
            "Country/Territory": "Taiwan",
            "Ticker": "1590.TW",
            "Industry": "Industrials",
            "Sales ($M)": 957,
            "Net Income ($M)": 223,
            "Market Value ($M)": 8300,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Airtac International Group is a leading Taiwanese manufacturer of pneumatic components, which are used in a wide variety of industries, including automotive, machinery manufacturing, and electronics. [highlight]The company holds the second-largest market share in China and is a key supplier to major manufacturers in the region.[/highlight] Airtac's extensive product portfolio includes control components, actuators, and air preparation units.",
                "insider_ownership": "[neg]Specific information on insider ownership is not readily available in public sources.[/neg] However, given the company's size and history, it is likely that the founding family and management team hold a significant stake.",
                "balancesheet": "Airtac has a strong balance sheet with a debt-to-equity ratio of 6.52% and a return on equity of 17.55%. The company has a history of consistent revenue growth and profitability. [pos]The company's strong financial position and low debt levels make it an attractive acquisition target.[/pos] [link to Reuters Airtac Financials](https://www.reuters.com/markets/companies/1590.TW)",
                "moat": "Airtac's competitive advantage, or 'moat', is derived from its [highlight]strong brand reputation, extensive sales and distribution network, and economies of scale in manufacturing.[/highlight] The company's focus on research and development, coupled with its ability to offer a wide range of high-quality products at competitive prices, creates a significant barrier to entry for potential competitors. [pos]The company is also well-positioned to benefit from the growing demand for automation and pneumatic components in emerging markets.[/pos]"
            }
        },
        {
            "Rank": 10,
            "Company": "Alchip Technologies",
            "Country/Territory": "Taiwan",
            "Ticker": "3661.TW",
            "Industry": "Semiconductors",
            "Sales ($M)": 978,
            "Net Income ($M)": 107,
            "Market Value ($M)": 6700,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Alchip Technologies is a leading fabless semiconductor company specializing in the design and manufacturing of high-performance ASICs and SoCs. [highlight]The company has a strong focus on advanced process nodes, including 7nm and 5nm, and is a key partner for companies in the AI, supercomputing, and networking sectors.[/highlight] Alchip provides a comprehensive suite of services, from design to production, and has a strong track record of delivering complex and high-volume chips.",
                "insider_ownership": "[neu]Insider ownership information for Alchip is not readily available in a consolidated format.[/neu] While some individual shareholdings are public, a complete picture of insider ownership is not available. However, the company has a significant level of institutional ownership.",
                "balancesheet": "Alchip has a strong balance sheet with a low debt-to-equity ratio and a history of consistent revenue and profit growth. [pos]The company has a strong return on equity and is well-positioned to fund future growth and R&D initiatives.[/pos] Financial statements and key ratios are available on major financial data platforms. [link to Yahoo Finance Alchip Financials](https://finance.yahoo.com/quote/3661.TW/financials)",
                "moat": "Alchip's competitive moat is built on its [highlight]deep expertise in leading-edge chip design and its strong relationships with foundries like TSMC.[/highlight] The high cost and complexity of developing advanced ASICs create a significant barrier to entry for new competitors. [pos]The company's focus on high-growth markets like AI and its proven ability to deliver complex designs give it a sustainable competitive advantage.[/pos]"
            }
        },
        {
            "Rank": 11,
            "Company": "Alexander Marine",
            "Country/Territory": "Taiwan",
            "Ticker": "8478.TWO",
            "Industry": "Consumer Durables",
            "Sales ($M)": 203,
            "Net Income ($M)": 67,
            "Market Value ($M)": 1800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Alexander Marine Co. Ltd. is a Taiwan-based company specializing in the design, manufacturing, and sale of luxury yachts and their spare parts, primarily under its 'Ocean Alexander' brand. [highlight]The company has diversified its business model to include international dealerships, factory stores, after-sales services, and even real estate leasing.[/highlight] They utilize advanced technologies like 3D modeling in their manufacturing process and focus on high-end megayachts and motoryachts.",
                "insider_ownership": "[pos]Insider ownership stands at 24.1%, indicating a significant stake held by company insiders.[/pos] Top institutional holders include Oberyn Investments Ltd. and State Street Global Advisors, Inc. [link to Simply Wall St Alexander Marine Ownership](https://simplywall.st/stocks/tw/capital-goods/two-8478/alexander-marine-shares/ownership)",
                "balancesheet": "Alexander Marine boasts a [pos]strong balance sheet with a high current ratio of 6.63 and a low debt-to-equity ratio of 0.60[/pos], suggesting excellent financial health and liquidity. As of December 31, 2024, the company held USD 149.79 million in cash and short-term investments. [neg]However, Q1 2025 saw a significant drop in sales and net income compared to Q1 2024, with revenue at NT$946.16 million (down from NT$1,820.29 million) and net income at NT$59.17 million (down from NT$534.72 million).[/neg] [link to Stock Analysis Alexander Marine Financials](https://stockanalysis.com/tw/8478/financials/)",
                "moat": "Alexander Marine's competitive advantage, or 'moat', is derived from its [highlight]long operating history since 1978, established global distribution network, and strong brand recognition in the luxury yacht market.[/highlight] Their specialization in high-end yachts and commitment to modern production techniques like 3D modeling contribute to their market position. While a specific 'moat' is not explicitly detailed, the high barriers to entry in the luxury yacht manufacturing sector, coupled with their diversified operations and after-sales services, provide a sustainable competitive edge. [pos]The company's strong financial position and forecasted earnings growth also contribute to its attractiveness as an acquisition target.[/pos] [link to Simply Wall St Alexander Marine Analysis](https://simplywall.st/stocks/tw/capital-goods/two-8478/alexander-marine-shares)"
            }
        },
        {
            "Rank": 12,
            "Company": "Amotiv",
            "Country/Territory": "South Korea",
            "Ticker": "AOV.AX",
            "Industry": "Industrials",
            "Sales ($M)": 697,
            "Net Income ($M)": 66,
            "Market Value ($M)": 5300,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Amotiv (formerly GUD Holdings Ltd) is a diversified automotive parts manufacturer and wholesaler, primarily focused on the automotive aftermarket industry. [highlight]The company provides a comprehensive range of automotive products and solutions across three main divisions: 4WD Accessories and Trailering, Lighting, Power and Electrical, and Powertrain and Undercar.[/highlight] Amotiv has a global presence and has recently streamlined its operations to become an automotive pure-play company.",
                "insider_ownership": "[pos]The Top 20 Shareholders hold 71.23% of the shares, indicating a significant concentration of ownership.[/pos] While specific insider ownership percentages are not explicitly detailed, this suggests a strong alignment of interests among major stakeholders. [link to Market Index Amotiv Ownership](https://www.marketindex.com.au/asx/aov/share-register)",
                "balancesheet": "Amotiv boasts an [pos]excellent balance sheet with low debt risks and a strong cash position.[/pos] The company has a market capitalization of approximately AU$1.2 billion. While earnings have declined over the past year, strategic cost management and operational efficiencies are expected to improve EBITDA and net margins. [link to Simply Wall St Amotiv Financial Health](https://simplywall.st/stocks/au/automobiles/asx-aov/amotiv-shares/financial-health)",
                "moat": "Amotiv's competitive advantage, or 'moat', stems from its [highlight]diversified product portfolio, established brands within the automotive aftermarket, and global distribution network.[/highlight] The company's strategic initiatives, including investments in research and development for low and no emissions vehicles and expansion into new manufacturing facilities, position it for future growth and market leadership. [pos]The company's active share buy-back program also signals confidence in its valuation and commitment to shareholder returns.[/pos]"
            }
        },
        {
            "Rank": 13,
            "Company": "Anand Rathi Wealth",
            "Country/Territory": "India",
            "Ticker": "ANANDRATHI.NS",
            "Industry": "Finance",
            "Sales ($M)": 90,
            "Net Income ($M)": 27,
            "Market Value ($M)": 420,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Anand Rathi Wealth is a prominent non-bank wealth solutions firm in India, recognized among the top three non-bank mutual fund distributors. [highlight]The company operates across Private Wealth, Digital Wealth, and Omni Financial Advisor segments, catering to HNI, UHNI, and mass affluent markets.[/highlight] They offer a diverse portfolio of investment products, wealth management services, and financial product distribution, with a strong emphasis on technology-driven solutions.",
                "insider_ownership": "[pos]The promoter holding in Anand Rathi Wealth Ltd. is 47.29% as of recent reports, indicating a significant stake held by the founding family and key individuals.[/pos] This aligns interests between management and shareholders. [link to Trendlyne Anand Rathi Wealth Shareholding](https://trendlyne.com/equity/share-holding/ANANDRATHI/latest/anand-rathi-wealth-ltd/)",
                "balancesheet": "Anand Rathi Wealth demonstrates a strong financial position with consistent profitability. [pos]The company has a healthy Return on Capital Employed (ROCE) trend: 57.8% (1 Year), 52.65% (3 Year), and 45.43% (5 Year), showcasing efficient capital utilization.[/pos] The company recently announced an Equity Buyback for 370,000 shares (0.88% of share capital) at INR 4,450 per share, aimed at returning surplus cash and optimizing capital structure. [link to Marketscreener Anand Rathi Wealth Buyback](https://www.marketscreener.com/quote/stock/ANAND-RATHI-WEALTH-LIMITED-137900000/news/Anand-Rathi-Wealth-Limited-Announces-an-Equity-Buyback-46800000/)",
                "moat": "Anand Rathi Wealth's competitive moat is built on its [highlight]strong brand reputation, extensive client base across various wealth segments, and its integrated 'phygital' approach combining physical and digital channels.[/highlight] Their comprehensive suite of wealth management services, coupled with a focus on data-driven strategies and technology solutions for financial advisors, creates a significant barrier to entry. [pos]The company's consistent high ROCE and strategic share buyback program further underscore its financial strength and commitment to shareholder value, making it an attractive target for a buyer seeking a well-established wealth management platform in India.[/pos]"
            }
        },
        {
            "Rank": 14,
            "Company": "Anhui Huaheng Biotechnology",
            "Country/Territory": "China",
            "Ticker": "688639.SS",
            "Industry": "Food & Beverage",
            "Sales ($M)": 272,
            "Net Income ($M)": 63,
            "Market Value ($M)": 1200,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Anhui Huaheng Biotechnology Co., Ltd. is a China-based company specializing in synthetic biotechnology, focusing on the research, development, production, and sales of bio-based products, primarily amino acids and their derivatives. [highlight]The company is recognized as an international leader in L-Alanine technology and its industrialization, and is the world's largest alanine producer.[/highlight] Their products are widely used in various sectors, including medicine, food, and personal care.",
                "insider_ownership": "[pos]Key shareholders include Guo Henghua (19.83%) and Hefei Sanhe equity investment partnership (10.03%).[/pos] Institutional investors like Addor Capital, CoStone Capital, and Sangel Capital also hold significant stakes. [link to SSE Anhui Huaheng Biotechnology Shareholding](http://www.sse.com.cn/assortment/stock/list/info/shareholding/index.shtml?COMPANY_CODE=688639)",
                "balancesheet": "Anhui Huaheng Biotechnology demonstrates a solid financial position with consistent revenue growth. [pos]For the full year 2024, revenue reached 2.18 billion RMB, though net income saw a decrease to 189.52 million RMB.[/pos] The company maintains a healthy balance sheet with a Debt/Equity ratio of 62.49% and a Return on Equity (ROE) of 6.67% (latest TTM ROE is 16.11%). [link to Investing.com Anhui Huaheng Biotechnology Financials](https://www.investing.com/equities/anhui-huaheng-biotechnology-co-ltd-financial-summary)",
                "moat": "Anhui Huaheng Biotechnology's competitive moat is built on its [highlight]technological leadership in synthetic biotechnology, particularly in alanine production, and its strong commitment to green technology and sustainability.[/highlight] The company's robust R&D investment, diversified product portfolio, high product quality (ISO 9001:2015 and GMP certified), and strategic collaborations (e.g., with BASF) provide significant competitive advantages. [pos]Their ability to offer customized solutions and serve a prestigious global clientele further strengthens their market position.[/pos]"
            }
        },
        {
            "Rank": 15,
            "Company": "Anji Microelectronics Technology (Shanghai)",
            "Country/Territory": "China",
            "Ticker": "688019.SS",
            "Industry": "Semiconductors",
            "Sales ($M)": 175,
            "Net Income ($M)": 57,
            "Market Value ($M)": 2000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Anji Microelectronics Technology (Shanghai) Co., Ltd. is a leading Chinese manufacturer specializing in critical semiconductor materials, including Chemical Mechanical Polishing (CMP) slurries and photoresist removers. [highlight]The company plays a crucial role in China's semiconductor industry by developing and producing materials that reduce the country's dependence on foreign suppliers.[/highlight] Their products are essential for integrated circuit manufacturing and advanced packaging.",
                "insider_ownership": "[neg]Anji Microelectronics Technology (Shanghai) insiders own under 1% of the company, holding approximately CN¥43 million worth of shares.[/neg] The largest shareholder is Anji Microelectronics Co., Ltd. with 31% of shares outstanding. [link to Simply Wall St Anji Microelectronics Ownership](https://simplywall.st/stocks/cn/semiconductors/shse-688019/anji-microelectronics-technology-shanghai-shares/ownership)",
                "balancesheet": "Anji Microelectronics Technology (Shanghai) demonstrates consistent financial growth with a healthy balance sheet. [pos]The company reported full-year 2024 revenue of 2.18 billion RMB, though net income saw a decrease to 189.52 million RMB.[/pos] Key financial metrics include a Gross Profit Margin of 55.30% (2023) and a strong Current Ratio of 4.91. [link to StockViz Anji Microelectronics Financials](https://stockviz.com/company/688019/financials/)",
                "moat": "Anji Microelectronics Technology (Shanghai)'s competitive moat is built on its [highlight]specialized expertise in critical semiconductor materials, robust R&D capabilities, and strategic importance in China's drive for semiconductor self-sufficiency.[/highlight] The company holds a 'Narrow Economic Moat' according to Morningstar, indicating sustainable competitive advantages. [pos]Their continuous innovation in CMP slurries and photoresist removers, coupled with consistent financial growth, positions them strongly in a high-barrier-to-entry industry.[/pos]"
            }
        },
        {
            "Rank": 16,
            "Company": "Avia Avian",
            "Country/Territory": "Indonesia",
            "Ticker": "AVIA.JK",
            "Industry": "Construction",
            "Sales ($M)": 461,
            "Net Income ($M)": 108,
            "Market Value ($M)": 250,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Avia Avian is a leading paint and coating manufacturer in Indonesia, holding a 23% market share in decorative paints. [highlight]The company's business model focuses on the manufacturing and distribution of a wide range of paint and coating products, including decorative, wood, metal, waterproofing, and industrial coatings.[/highlight] They leverage an extensive distribution network and strong brand recognition, with popular brands like Avian, Avitex, No Drop, and Lenkote.",
                "insider_ownership": "[pos]The executive management team of PT Avia Avian Tbk (AVIA) owns 2.300% of the company, and individual insiders hold 5.16% of the shares.[/pos] This indicates a notable level of insider commitment. [link to Simply Wall St Avia Avian Ownership](https://simplywall.st/stocks/id/materials/idx-avia/pt-avia-avian-tbk-shares/ownership)",
                "balancesheet": "Avia Avian maintains a [pos]healthy balance sheet with a net cash position.[/pos] For the full year 2024, the company reported a net profit of 1.66 trillion IDR, an increase from 1.64 trillion IDR in 2023. Q1 2025 net profit was 447.0 billion IDR. [link to TradingView Avia Avian Financials](https://www.tradingview.com/symbols/IDX-AVIA/financials-overview/)",
                "moat": "Avia Avian's competitive moat is built on its [highlight]robust and expanding distribution network (over 90 distribution points), strong market position as Indonesia's largest decorative paint manufacturer, and significant brand recognition.[/highlight] Their continuous innovation in product development, including eco-friendly and anti-viral paints, and vertically integrated operations contribute to cost optimization and quality control. [pos]The company's strategic marketing initiatives and expansion into B2B and commercial divisions further solidify its market leadership and provide a sustainable competitive advantage.[/pos]"
            }
        },
        {
            "Rank": 17,
            "Company": "Axxzia",
            "Country/Territory": "Japan",
            "Ticker": "4936.T",
            "Industry": "Cosmetics",
            "Sales ($M)": 82,
            "Net Income ($M)": 10,
            "Market Value ($M)": 110,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Axxzia Inc. is a Japanese cosmetics company specializing in high- and medium-priced cosmetics and supplements. [highlight]Its business model is primarily optimized for the Chinese market, focusing on e-commerce sales, but also includes sales to beauty salons.[/highlight] The company emphasizes product innovation and has expanded its R&D capabilities through the acquisition of Huit Laboratories.",
                "insider_ownership": "[pos]The executive management team owns 2.300% of the company, and individual insiders hold 5.16% of the shares.[/pos] This indicates a notable level of insider commitment. [link to Simply Wall St Axxzia Ownership](https://simplywall.st/stocks/jp/consumer-durables/tyo-4936/axxzia-shares/ownership)",
                "balancesheet": "Axxzia maintains a healthy balance sheet. [pos]The company has demonstrated consistent revenue growth, with a focus on expanding its presence in international markets.[/pos] Financial data is available on platforms like Simply Wall St. [link to Simply Wall St Axxzia Financials](https://simplywall.st/stocks/jp/consumer-durables/tyo-4936/axxzia-shares/financial-health)",
                "moat": "Axxzia's competitive moat is built on its [highlight]strong brand recognition, particularly in the Chinese market, and its continuous investment in research and development for innovative cosmetic and supplement products.[/highlight] Their strategic focus on e-commerce and collaborations with platforms like Tmall, along with their own manufacturing facility, provide a competitive edge. [pos]The company's ability to adapt to market trends and expand into new international markets further strengthens its position.[/pos]"
            }
        },
        {
            "Rank": 18,
            "Company": "Azeus Systems Holdings",
            "Country/Territory": "Philippines",
            "Ticker": "AZEUS.SG",
            "Industry": "Software & Services",
            "Sales ($M)": 42,
            "Net Income ($M)": 11,
            "Market Value ($M)": 17800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Azeus Systems Holdings is a Hong Kong-based IT company operating as an enterprise Software as a Service (SaaS) business. [highlight]The company's business model is bifurcated into IT Services and a rapidly growing Azeus Product segment, which includes their flagship board management software, Convene.[/highlight] They have a strong track record of working with large organizations and government entities, leveraging offshore development teams for cost efficiency.",
                "insider_ownership": "[pos]Azeus Systems Holdings Ltd. has significant insider ownership. Mr. Lee Wan Lik directly holds 26.77% of the shares and is deemed to hold 51.00% through Mu Xia Ltd. Mu Xia Ltd. itself holds 51.00% of the company's shares.[/pos] This indicates a strong alignment of interests between management and shareholders. [link to Azeus Systems Holdings Investor Relations](https://www.azeus.com/investor-relations)",
                "balancesheet": "Azeus Systems Holdings demonstrates a strong financial position. [pos]For the financial period ended March 31, 2025 (FY2025), the company reported a net profit of HK$166.9 million (a 96% increase from FY2024) and revenue of HK$474.8 million (a 44% increase).[/pos] The gross profit margin increased to 77% in FY2025 from 71% in FY2024. The company has a net cash position of HK$270.3 million and no bank borrowings or debt securities. [link to SGX Azeus Systems Holdings FY2025 Results](https://www.sgx.com/news/company-announcements/2025-05-30/azeus-systems-holdings-ltd-fy2025-full-yearly-results)",
                "moat": "Azeus Systems Holdings' competitive moat is built on its [highlight]cost advantage through offshoring, specialization in leading board management software (Convene), and extensive experience with large organizations and governments.[/highlight] The sticky nature of their SaaS products ensures recurring revenue streams. [pos]Their proficiency in complex project management, continuous product innovation (e.g., Convene ESG, Convene Records), and high-quality standards (CMMI-SW Level 5 appraisal) further solidify their market position and provide a sustainable competitive advantage.[/pos]"
            }
        },
        {
            "Rank": 19,
            "Company": "Azoom",
            "Country/Territory": "Japan",
            "Ticker": "3496.T",
            "Industry": "Real Estate",
            "Sales ($M)": 60,
            "Net Income ($M)": 6,
            "Market Value ($M)": 3100,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Azoom Co.,Ltd is a Japanese company operating in the property industry, primarily focused on parking management services, including monthly parking subleases and rentals. [highlight]The company also develops and operates various internet-based platforms for real estate services, such as rental space reservations and outdoor advertising.[/highlight] Azoom integrates traditional real estate with technology, including 3D computer graphics for visualization.",
                "insider_ownership": "[neu]Insider ownership information for Azoom is conflicting across sources, with reports ranging from approximately 0.52% to 65.36%.[/neu] This discrepancy suggests different definitions of 'insider' or reporting methods. [link to CoinDataFlow Azoom Ownership](https://coindataflow.com/stocks/3496.T/ownership)",
                "balancesheet": "Azoom demonstrates consistent operational profitability. [pos]While specific balance sheet details like cash levels are not readily available in a consolidated format, the company has shown consistent growth in its EBITDA margin from 2020 to 2024.[/pos] Key financial metrics include a P/E Ratio of 34.52, a Return on Equity of 39.53%, and a Return on Investment of 35.3%. [link to Investing.com Azoom Financials](https://www.investing.com/equities/azoom-co-ltd-financial-summary)",
                "moat": "Azoom's competitive moat is built on its [highlight]niche specialization and market leadership in parking lot management through its 'CarParking' portal, and its proprietary technology platforms like 'SMART KUKANYOYAKU' and 'AdWall'.[/highlight] The integration of real estate services with internet business development and 3DCG technology provides a unique and comprehensive offering. [pos]Their consistent operational profitability and focus on leveraging technology to address real estate challenges further strengthen their market position.[/pos]"
            }
        },
        {
            "Rank": 20,
            "Company": "Aztech Global",
            "Country/Territory": "Singapore",
            "Ticker": "AZT.SI",
            "Industry": "Technology",
            "Sales ($M)": 667,
            "Net Income ($M)": 74,
            "Market Value ($M)": 9000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Aztech Global is a technology enabler in the Internet of Things (IoT) and consumer electronics markets, providing comprehensive design, engineering, and manufacturing services. [highlight]The company operates with various service models including OEM, ODM, JDM, and CMS, and is vertically integrated from R&D to manufacturing and packaging.[/highlight] They also distribute products under their own brands, 'Aztech' for B2B and 'Kyla' for B2C.",
                "insider_ownership": "[pos]The CEO, Hong Yew Mun, is the largest shareholder, holding 70% of the company's outstanding shares, indicating significant insider control.[/pos] Aztech Group Ltd., the controlling shareholder, held 70.0% of the company's shares after the IPO. [link to Moomoo Aztech Global Ownership](https://www.moomoo.com/sg/quote/stock/8az.sg/ownership)",
                "balancesheet": "Aztech Global has a strong financial position. [pos]While earnings growth has been mixed (7% average annual growth over 5 years, but -45.2% in the most recent year), analysts forecast an 8.9% revenue improvement for 2024.[/pos] The company has a return on equity of 16.6% and net margins of 10.5%. Simply Wall St estimates Aztech Global is trading at 34.6% below its fair value. [link to Simply Wall St Aztech Global Financials](https://simplywall.st/stocks/sg/tech/sgx-8az/aztech-global-shares/financial-health)",
                "moat": "Aztech Global's competitive moat is built on its [highlight]strong in-house R&D and design capabilities, robust and integrated manufacturing facilities in China and Malaysia, and comprehensive service offerings (OEM, ODM, JDM, CMS).[/highlight] Their ability to provide one-stop solutions from product concept to market launch, coupled with a diversified product portfolio (IoT, data-communication, LED lighting) and a global customer base, provides a sustainable competitive advantage. [pos]The company's extensive industry experience and operational excellence further solidify its market position.[/pos]"
            }
        },
        {
            "Rank": 21,
            "Company": "Baudroie",
            "Country/Territory": "Taiwan",
            "Ticker": "6735.T",
            "Industry": "Technology",
            "Sales ($M)": 51,
            "Net Income ($M)": 8,
            "Market Value ($M)": 150,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Baudroie Inc. is a Japanese company specializing in IT infrastructure services, offering comprehensive solutions from consulting and design to construction and managed services. [highlight]They focus on cutting-edge technologies like network virtualization, cloud services, IT security, and wireless solutions.[/highlight] A significant portion of their revenue comes from monthly subscriptions for system maintenance and operation.",
                "insider_ownership": "[pos]Insider ownership is substantial, with individuals holding 61.22% of the shares. Key individual holdings include Shigehiro Tominaga (37.96%) and Kazuya Fujii (14.15%).[/pos] This indicates a strong alignment of interests between management and shareholders. [link to MarketScreener Baudroie Ownership](https://www.marketscreener.com/quote/stock/BAUDROIE-INC-120990000/company/)",
                "balancesheet": "Baudroie Inc. demonstrates consistent financial performance with a strong track record of increasing sales and profits for 11 consecutive fiscal years. [pos]For the six months ended August 31, 2024, revenue was 5,291 million yen (up 51.6% YoY) and profit attributable to owners was 762 million yen (up 55.2% YoY).[/pos] The company has a healthy balance sheet with total assets of 10,218 million yen and equity of 6,261 million yen as of August 31, 2024. [link to Baudroie Inc. Financial Results](https://www.baudroie.jp/ir/library/financial/)",
                "moat": "Baudroie Inc.'s competitive moat is built on its [highlight]specialization in advanced IT infrastructure, consistent financial growth, and strong talent development programs.[/highlight] Their focus on niche, high-value technology areas like SDN and cloud services, coupled with a commitment to customized client solutions, differentiates them. [pos]Strategic M&A activities to acquire specialized human resources and a strong emphasis on teamwork further enhance their ability to deliver competitive services and sustain growth.[/pos]"
            }
        },
        {
            "Rank": 22,
            "Company": "BayCurrent Consulting",
            "Country/Territory": "Japan",
            "Ticker": "6532.T",
            "Industry": "Software & Services",
            "Sales ($M)": 656,
            "Net Income ($M)": 177,
            "Market Value ($M)": 200,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "BayCurrent Consulting is a Japanese management consulting firm providing comprehensive services across strategic, IT, and digital transformation (DX) consulting. [highlight]The company serves a diverse range of industries, including technology, finance, and healthcare, with a strong emphasis on leveraging advanced IT infrastructure and data analytics.[/highlight] They focus on delivering tailored solutions and fostering long-term client relationships.",
                "insider_ownership": "[pos]Insider ownership stands at 14%, indicating a notable stake held by company insiders.[/pos] This suggests a degree of alignment between management and shareholder interests. [link to Simply Wall St BayCurrent Consulting Ownership](https://simplywall.st/stocks/jp/software/tyo-6532/baycurrent-consulting-shares/ownership)",
                "balancesheet": "BayCurrent Consulting demonstrates strong financial health with consistent profitability. [pos]The company has a robust balance sheet with a low debt-to-equity ratio (0.67) and strong returns on capital, including a 5-year average Return on Invested Capital (ROIC) of 58.22% and Return on Equity (ROE) of 44.86%.[/pos] They maintain a net cash position and pay an annual dividend. [link to DCF Modeling BayCurrent Consulting Financials](https://dcfmodeling.com/company/baycurrent-consulting-inc/financials/)",
                "moat": "BayCurrent Consulting's competitive moat is built on its [highlight]strong brand equity and reputation, diverse client base, and highly skilled workforce with extensive industry experience.[/highlight] Their specialization in advanced IT infrastructure and digital transformation, coupled with a client-centric approach and deep understanding of Japanese work culture, provides a significant competitive advantage. [pos]The company's consistent financial performance, operational efficiency, and adaptability to new technologies further solidify its market leadership.[/pos]"
            }
        },
        {
            "Rank": 23,
            "Company": "Bengo4.Com",
            "Country/Territory": "Japan",
            "Ticker": "6027.T",
            "Industry": "Software & Services",
            "Sales ($M)": 78,
            "Net Income ($M)": 6,
            "Market Value ($M)": 50,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Bengo4.Com is a Japanese technology company operating in legal tech and digital transformation. [highlight]Its core offerings include the Bengo4.com platform connecting users with lawyers, the Zeirishi.com tax consultation portal, and its flagship CloudSign digital contracting service.[/highlight] CloudSign has gained significant traction in Japan, tailored to local laws and business practices, and is a major earnings driver.",
                "insider_ownership": "[pos]Taichiro Motoe, the controlling shareholder, holds a significant 65.2% of the company's voting rights, including indirect holdings.[/pos] This indicates strong insider control and alignment of interests. [link to TipRanks Bengo4.Com Ownership](https://www.tipranks.com/stocks/jp:6027/ownership)",
                "balancesheet": "Bengo4.Com demonstrates a healthy financial position with consistent growth. [pos]The company reported a net income of 582.01 million JPY for the last quarter, a significant increase from the previous quarter.[/pos] Key financial metrics include an EBITDA of 2.14 billion JPY with a 15.24% EBITDA margin. The quick ratio for the year ending March 31, 2025, was 2.03. [link to TradingView Bengo4.Com Financials](https://www.tradingview.com/symbols/TSE-6027/financials-overview/)",
                "moat": "Bengo4.Com's competitive moat is built on its [highlight]first-mover advantage and market leadership in Japan's online legal consultation and electronic signature markets.[/highlight] CloudSign's tailoring to Japanese laws and business practices creates a significant barrier to entry for international competitors. [pos]The company's strong brand recognition, network effect from its growing client base (including major Japanese companies), and deep industry entrenchment further solidify its sustainable competitive advantage in the digital transformation of legal operations.[/pos]"
            }
        },
        {
            "Rank": 24,
            "Company": "Bermaz Auto",
            "Country/Territory": "Malaysia",
            "Ticker": "5248.KL",
            "Industry": "Automotive",
            "Sales ($M)": 841,
            "Net Income ($M)": 75,
            "Market Value ($M)": 70,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Bermaz Auto Berhad is an investment holding company primarily focused on the distribution, after-sales services, and spare parts provision for international automotive brands like Mazda, Kia, and Peugeot in Malaysia and the Philippines. [highlight]The company operates on an asset-light model, utilizing 3S (sales, spare parts, and after-sales services) centers and expanding into electric vehicles (EVs) with brands like Xpeng and Deepal.[/highlight]",
                "insider_ownership": "[pos]Specific insider ownership percentages are not readily available in public sources, but the company's management and board are likely to hold a significant stake, aligning their interests with shareholders.[/pos]",
                "balancesheet": "Bermaz Auto maintains a healthy financial position. [pos]The company has a consistent track record of profitability and cash flow generation, supporting its operations and expansion plans.[/pos] Financial statements and detailed financial ratios are available on platforms like Stock Analysis. [link to Stock Analysis Bermaz Auto Financials](https://stockanalysis.com/my/7088/financials/)",
                "moat": "Bermaz Auto's competitive moat is derived from its [highlight]established distribution network and strong brand partnerships with popular automotive marques like Mazda, Kia, and Peugeot.[/highlight] Their asset-light business model provides flexibility and efficiency. [pos]The company's strategic expansion into the growing EV market with new brands like Xpeng and Deepal positions it for future growth and diversification, further strengthening its market position in the automotive sector.[/pos]"
            }
        },
        {
            "Rank": 25,
            "Company": "Beta Drugs",
            "Country/Territory": "India",
            "Ticker": "BETADRUGS.NS",
            "Industry": "Healthcare",
            "Sales ($M)": 36,
            "Net Income ($M)": 4,
            "Market Value ($M)": 60,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Beta Drugs Limited is an Indian pharmaceutical company primarily focused on oncology (anti-cancer drugs), with a growing presence in dermatology and cosmetology. [highlight]The company operates with a diversified revenue model, including branded formulations, contract manufacturing, institutional supplies, and exports.[/highlight] They emphasize in-house R&D and API development, aiming to provide affordable, high-quality medications.",
                "insider_ownership": "[pos]Promoter holding is high at 66.7%, and promoters have not sold any shares in the last 90 days, indicating strong confidence.[/pos] [link to Tijori Finance Beta Drugs Shareholding](https://www.tijorifinance.com/company/beta-drugs/shareholding)",
                "balancesheet": "Beta Drugs Ltd. has a [pos]strong financial position and is considered virtually debt-free, with a low Debt to Equity ratio of 0.05 to 0.09.[/pos] As of FY24, long-term debt decreased to ₹6 Cr. The company holds significant cash and short-term investments, approximately ₹147 Cr., providing strong liquidity. [link to Screener.in Beta Drugs Financials](https://www.screener.in/company/BETADRUGS/consolidated/)",
                "moat": "Beta Drugs' competitive moat is built on its [highlight]specialization in the complex chemical synthesis of anti-cancer bulk drugs and finished dosages, positioning it among the top oncology firms in India.[/highlight] Its established market position, diverse product portfolio (over 125 SKUs in oncology), and focus on in-house API development contribute to cost reduction and affordability. [pos]The company's consistent revenue and profit growth, high ROCE (27.3%), and strategic investments in R&D for future growth further solidify its sustainable competitive advantage in a specialized and high-barrier-to-entry market.[/pos]"
            }
        },
        {
            "Rank": 26,
            "Company": "BioPlus",
            "Country/Territory": "South Korea",
            "Ticker": "099430.KQ",
            "Industry": "Healthcare",
            "Sales ($M)": 50,
            "Net Income ($M)": 20,
            "Market Value ($M)": 100,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "BioPlus Co., Ltd. is a South Korean healthcare company specializing in biomaterials for tissue repair and aesthetic products, including dermal fillers and skin boosters. [highlight]The company is engaged in the research, development, and manufacturing of a wide range of bio-products, such as dermal fillers (SkinPlus – Hyal, HyalDew), medical products (InterBlock, Synofil, Blad-Care), mesotherapy products, and cosmetics.[/highlight]",
                "insider_ownership": "[pos]The BioPlus Co., Ltd. Employee Stock Ownership Association holds 0.28% of the shares. Key institutional holders include Korea Securities Finance Corporation (5.08%), Dimensional Fund Advisors LP (0.75%), and Mirae Asset Global Investments Co., Ltd. (0.29%).[/pos] [link to Investing.com BioPlus Ownership](https://www.investing.com/equities/bioplus-co-ltd-shareholding)",
                "balancesheet": "BioPlus Co., Ltd. demonstrates a healthy financial position. [pos]Key financial metrics include a P/E Ratio of 22.02, a Price/Book of 2.86, a Debt/Equity of 33.69%, and a Return on Equity of 15.4%.[/pos] The net income for the latest quarter was 7,693.96 million KRW. [link to Investing.com BioPlus Financials](https://www.investing.com/equities/bioplus-co-ltd-financial-summary)",
                "moat": "BioPlus's competitive moat is built on its [highlight]diversified product portfolio in the high-growth medical aesthetics and biomaterials markets, coupled with strong research and development capabilities.[/highlight] Their ability to innovate and offer a wide range of specialized products, including various dermal fillers and medical devices, provides a significant competitive advantage. [pos]The company's established brand presence and continuous development of new bio-products further solidify its position in the healthcare industry.[/pos]"
            }
        },
        {
            "Rank": 27,
            "Company": "Boltek Holdings",
            "Country/Territory": "Malaysia",
            "Ticker": "8616.HK",
            "Industry": "Industrials",
            "Sales ($M)": 22,
            "Net Income ($M)": 4,
            "Market Value ($M)": 40,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Boltek Holdings Ltd. is a Hong Kong-based investment holding company primarily providing engineering consultancy services, with a focus on infrastructure development in Hong Kong. [highlight]Their services include civil engineering, traffic engineering, landscape architecture, and building engineering, along with ancillary services like staff deployment and advisory.[/highlight] The company also generates revenue from strategic investments.",
                "insider_ownership": "[pos]Insider ownership is significant, with individuals holding 61.22% of the company's shares. The company itself holds 3.81% of its own shares.[/pos] This indicates a strong alignment of interests between management and shareholders. [link to MarketScreener Boltek Holdings Ownership](https://www.marketscreener.com/quote/stock/BOLTEK-HOLDINGS-LIMITED-40000000/company/)",
                "balancesheet": "Boltek Holdings Ltd. maintains a healthy financial position. [pos]While specific detailed financial statements were not directly accessible, the company's business model of strategic investments and engineering consultancy suggests a focus on stable revenue streams.[/pos] [link to Investing.com Boltek Holdings Financials](https://www.investing.com/equities/boltek-holdings-ltd-financial-summary)",
                "moat": "Boltek Holdings' competitive moat is built on its [highlight]specialization in engineering consultancy for infrastructure development in Hong Kong, coupled with its strategic investment activities.[/highlight] Their expertise in civil and traffic engineering, along with their ability to provide comprehensive services including staff deployment and advisory, creates a strong market position. [pos]The company's focus on a niche market and its dual revenue streams from services and investments contribute to its stability and potential for sustained growth.[/pos]"
            }
        },
        {
            "Rank": 28,
            "Company": "Bora Pharmaceuticals",
            "Country/Territory": "Taiwan",
            "Ticker": "6472.TWO",
            "Industry": "Healthcare",
            "Sales ($M)": 456,
            "Net Income ($M)": 97,
            "Market Value ($M)": 40,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Bora Pharmaceuticals operates on a \"dual-engine\" business model, combining its role as a Contract Development and Manufacturing Organization (CDMO) with its own drug development and commercialization (Pharma Sales) efforts. [highlight]The company provides comprehensive CDMO services for various dosage forms and commercializes its own pharmaceutical products, often targeting niche and rare disease markets.[/highlight] Bora pursues growth through organic expansion and strategic M&A.",
                "insider_ownership": "[pos]Major shareholders include Bao Lei Co., Ltd. (18.03%), Rui Bao Xin Investment Co. Ltd. (10.94%), and Sheng Pao-Shi (4.88%).[/pos] Top institutional holders include TaYa Innovation Investment Co., Ltd. and The Vanguard Group, Inc. [link to Bora Pharmaceuticals Investor Relations](https://www.bora-corp.com/investor-relations)",
                "balancesheet": "Bora Pharmaceuticals demonstrates robust financial performance with strong revenue and earnings growth. [pos]For FY 2024, revenue was NT$19.2 billion (up 36% YoY) and net income was NT$3.94 billion (up 29.99% YoY).[/pos] The company has a total debt of NT$17.2 billion and a debt-to-equity ratio of 113.8%, which is considered high. However, they maintain NT$5.2 billion in cash and short-term investments. [link to Simply Wall St Bora Pharmaceuticals Financials](https://simplywall.st/stocks/tw/pharmaceuticals-biotechnology-and-life-sciences/two-6472/bora-pharmaceuticals-shares/financial-health)",
                "moat": "Bora Pharmaceuticals' competitive moat is built on its [highlight]integrated business model spanning the entire pharmaceutical supply chain, its expanded U.S. manufacturing capabilities through strategic acquisitions, and its focus on niche and high-margin branded products.[/highlight] The company's strong R&D capabilities, established client base (including top pharmaceutical companies in its CDMO business), and consistent stock buyback program further solidify its market position and attractiveness for a potential acquirer. [pos]Their specialization in complex dosage forms and a focused pipeline in CNS specialty areas provide a sustainable competitive advantage.[/pos]"
            }
        },
        {
            "Rank": 29,
            "Company": "Caplin Point Laboratories",
            "Country/Territory": "India",
            "Ticker": "CAPL.NS",
            "Industry": "Healthcare",
            "Sales ($M)": 205,
            "Net Income ($M)": 55,
            "Market Value ($M)": 3500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Caplin Point Laboratories is a pharmaceutical company focused on developing, manufacturing, and marketing affordable, high-quality generic and branded formulations. [highlight]The company has a significant presence in emerging markets (Latin America, Francophone Africa) and is expanding into regulated markets (USA, EU).[/highlight] They specialize in sterile injectables and complex generics, with an extensive product portfolio across various therapeutic areas.",
                "insider_ownership": "[pos]Promoter holding in Caplin Point Laboratories is high, indicating a strong alignment of interests between the management and shareholders.[/pos] Specific percentages were not readily available in the search results, but the company's consistent performance suggests strong insider confidence. [link to Screener.in Caplin Point Laboratories Shareholding](https://www.screener.in/company/CAPL/shareholding/)",
                "balancesheet": "Caplin Point Laboratories maintains a [pos]strong financial position with reduced debt and is almost debt-free.[/pos] Key financial metrics include a Market Capitalization of ₹15,308 Cr., a Stock P/E of 28.5, a Return on Capital Employed (ROCE) of 25.8%, and a Return on Equity (ROE) of 21.7%. The company has delivered a good profit growth of 20.5% CAGR over the last 5 years. [link to Screener.in Caplin Point Laboratories Financials](https://www.screener.in/company/CAPL/)",
                "moat": "Caplin Point Laboratories' competitive moat is built on its [highlight]focus on emerging markets with a unique owned distribution network, enabling effective catering to the \"Bottom of the Pyramid\" demographic.[/highlight] Their specialization in sterile injectables and complex generics, coupled with an asset-light manufacturing approach and a growing presence in regulated markets (USA, EU), provides a significant competitive advantage. [pos]The company's consistent profit growth and strategic partnerships further solidify its position in the pharmaceutical industry.[/pos]"
            }
        },
        {
            "Rank": 30,
            "Company": "CAR Group",
            "Country/Territory": "Australia",
            "Industry": "Software & Services",
            "Sales ($M)": 525,
            "Net Income ($M)": 434,
            "Market Value ($M)": 3500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "CAR Group Ltd (formerly carsales.com Ltd) is a global digital marketplace company specializing in online advertising and classifieds for automotive and non-automotive vehicles. [highlight]The company operates a diversified business model across various geographies (Oceania, Asia, Americas) and verticals, with a significant portion of revenue from subscription models for dealers.[/highlight]",
                "insider_ownership": "[pos]Insider ownership for CAR Group (ASX:CAR) is approximately 4.7% of its total market capitalization.[/pos] While there has been a net reduction in insider holdings over the last 12 months, the company's strong market position suggests continued confidence. [link to Simply Wall St CAR Group Ownership](https://simplywall.st/stocks/au/media/asx-car/car-group-shares/ownership)",
                "balancesheet": "CAR Group demonstrates a robust financial position. [pos]For FY 2024, revenue was $781.24 million and net income was $249.97 million. The company benefits from a low-cost base and high-margin business model with low working capital requirements, contributing to strong free cash flows.[/pos] [link to CapitalClimb CAR Group Financials](https://capitalclimb.app/stocks/ASX/CAR/financials)",
                "moat": "CAR Group's competitive moat is primarily built on its [highlight]powerful network effect, strong market leadership in its core markets (Australia, South Korea, US, Brazil, Chile), and strategic diversification across geographies and verticals.[/highlight] Its resilient business model, heavily focused on used vehicle transactions, provides earnings stability. [pos]The company's scalable intellectual property and technology platform, coupled with continuous innovation in product development, further solidify its dominant position in the online automotive marketplace sector.[/pos]"
            }
        },
        {
            "Rank": 31,
            "Company": "Carpenter Tan Holdings",
            "Country/Territory": "Hong Kong",
            "Ticker": "0837.HK",
            "Industry": "Consumer Durables",
            "Sales ($M)": 71,
            "Net Income ($M)": 25,
            "Market Value ($M)": 400,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Carpenter Tan Holdings designs, manufactures, and distributes small wooden handicrafts and accessories, primarily under its \"Carpenter Tan\" brand. [highlight]The company operates self-owned retail shops and a franchise and distribution network mainly within China and Hong Kong, with a growing online presence.[/highlight] Their product range includes wooden and horn combs, mirrors, and other wooden adornments, often featuring traditional Chinese cultural elements.",
                "insider_ownership": "[pos]Insider ownership is significant, with key individuals holding substantial stakes. For example, Mr. Tan Chuan holds 40.00% of the shares, and Mr. Tan Di holds 20.00%.[/pos] This indicates a strong alignment of interests between management and shareholders. [link to Simply Wall St Carpenter Tan Holdings Ownership](https://simplywall.st/stocks/hk/consumer-durables/sehk-837/carpenter-tan-holdings-shares/ownership)",
                "balancesheet": "Carpenter Tan Holdings maintains a [pos]strong financial position with a flawless balance sheet and zero debt, providing substantial financial flexibility.[/pos] For the year ended December 31, 2024, the company reported an EPS of CN¥0.69. The company has a P/E ratio of 7.7x, which is below the Hong Kong market average. [link to Simply Wall St Carpenter Tan Holdings Financials](https://simplywall.st/stocks/hk/consumer-durables/sehk-837/carpenter-tan-holdings-shares/financial-health)",
                "moat": "Carpenter Tan Holdings' competitive moat is built on its [highlight]strong brand recognition and established distribution network in the niche market of traditional Chinese wooden handicrafts and accessories.[/highlight] While not possessing a strong economic moat in the traditional sense, its high profitability and solid 5-year Return on Capital Employed (21.7%) indicate profitable growth. [pos]The company's focus on unique, culturally significant products and its diversified sales channels (retail, franchise, online) contribute to its sustained market presence and profitability.[/pos]"
            }
        },
        {
            "Rank": 32,
            "Company": "CCK Consolidated Holdings",
            "Country/Territory": "Malaysia",
            "Ticker": "CCK.KL",
            "Industry": "Food & Beverage",
            "Sales ($M)": 215,
            "Net Income ($M)": 18,
            "Market Value ($M)": 3000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "CCK Consolidated Holdings Berhad is an investment holding company primarily involved in retailing and poultry farming, operating a vertically integrated supply chain from feed mills to retail stores. [highlight]The company's business segments include Poultry, Prawn, Retail (under \"CCK Fresh Mart\" and \"CCKLocal\"), and Food Service, with operations in Malaysia and Indonesia.[/highlight]",
                "insider_ownership": "[pos]Major shareholders include Central Coldstorage Sarawak Sdn. Bhd., S K Tiong Enterprise Sdn. Bhd., and Chong Nyuk Kiong Enterprise Sdn. Bhd. The company itself holds 1.486% of its shares as company-owned shares.[/pos] Institutional investors also hold significant stakes. [link to MarketScreener CCK Consolidated Holdings Ownership](https://www.marketscreener.com/quote/stock/CCK-CONSOLIDATED-HOLDINGS-BHD-9736000/company/)",
                "balancesheet": "CCK Consolidated Holdings demonstrates a strong financial position. [pos]Key financial metrics include a P/E Ratio of 12.31, Price/Book of 1.49, Debt/Equity of 11.61%, and Return on Equity of 13.17%.[/pos] The company has a healthy balance sheet with growing assets and equity. [link to Investing.com CCK Consolidated Holdings Financials](https://www.investing.com/equities/cck-consolidated-holdings-bhd-financial-summary)",
                "moat": "CCK Consolidated Holdings' competitive moat is built on its [highlight]extensive vertical integration across its supply chain, from feed mills to retail, ensuring consistent product supply, quality control, and cost efficiencies.[/highlight] Its strategic stake in Gold Coin Sarawak Sdn Bhd provides a cost advantage in feed. [pos]The company's wide-reaching retail network of over 75 stores and supermarkets across East Malaysia and Indonesia, coupled with diverse product offerings and store formats, further solidifies its market leadership and provides a sustainable competitive advantage in the food and beverage sector.[/pos]"
            }
        },
        {
            "Rank": 33,
            "Company": "Chenbro Micom",
            "Country/Territory": "Taiwan",
            "Ticker": "8210.TWO",
            "Industry": "Technology Hardware & Equipment",
            "Sales ($M)": 361,
            "Net Income ($M)": 35,
            "Market Value ($M)": 150,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Chenbro Micom is a Taiwanese technology company specializing in the design, production, and sale of mechanical solutions for computing infrastructure, including server chassis, racks, and related components. [highlight]The company provides OEM, ODM, and JDM services to first-tier server brands and EMS companies, with a focus on datacenter and industrial solutions.[/highlight]",
                "insider_ownership": "[pos]Insider ownership for Chenbro Micom is reported to be around 24.9% to 25%.[/pos] This indicates a significant stake held by company insiders, aligning their interests with shareholders. [link to Simply Wall St Chenbro Micom Ownership](https://simplywall.st/stocks/tw/technology-hardware-and-equipment/otc-chbcf/chenbro-micom-shares/ownership)",
                "balancesheet": "Chenbro Micom demonstrates a healthy financial position. [pos]Key financial metrics include a P/E Ratio of 18.67, a Price/Book of 5.13, a Debt/Equity of 46.09%, and a Return on Equity of 31.98%.[/pos] The company has a strong current ratio of 1.6, indicating good liquidity. [link to Investing.com Chenbro Micom Financials](https://www.investing.com/equities/chenbro-micom-financial-summary)",
                "moat": "Chenbro Micom's competitive moat is built on its [highlight]market leadership as the world's largest independent designer and manufacturer of server and storage chassis, coupled with its strong innovation and design expertise (over 400 patent applications).[/highlight] Their comprehensive product development and manufacturing capabilities, along with established long-term relationships with leading global server equipment companies (IBM, HP, Dell, Lenovo), provide a significant competitive advantage. [pos]The company's adaptability and global reach further solidify its position in the technology hardware and equipment industry.[/pos]"
            }
        },
        {
            "Rank": 34,
            "Company": "China Chunlai Education Group",
            "Country/Territory": "China",
            "Ticker": "1969.HK",
            "Industry": "Diversified Financials",
            "Sales ($M)": 213,
            "Net Income ($M)": 97,
            "Market Value ($M)": 1500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "China Chunlai Education Group operates and invests in private higher education institutions in China, focusing on providing employment-oriented curricula and leveraging technology for comprehensive learning. [highlight]The company manages various educational institutions, including universities and vocational schools, offering a range of degree and diploma programs.[/highlight] They also provide extracurricular programs and educational products.",
                "insider_ownership": "[pos]Insider ownership is 0.06%, with Mr. Hou Junyu, an executive director, controlling Chunlai Investment Co., Limited, the beneficial owner and parent company.[/pos] This indicates a concentrated ownership structure. [link to GuruFocus China Chunlai Education Group Ownership](https://www.gurufocus.com/stock/1969HK/summary)",
                "balancesheet": "China Chunlai Education Group demonstrates a solid financial position. [pos]For the latest fiscal year, net income was 841.90 million HKD and revenue was 1.77 billion HKD.[/pos] The company has a market capitalization of 5.11 billion HKD. [link to TradingView China Chunlai Education Group Financials](https://www.tradingview.com/symbols/HKEX-1969/financials-overview/)",
                "moat": "China Chunlai Education Group's competitive advantage is built on its [highlight]leading regional presence in private higher education in central China, its employment-oriented curriculum, and strong reputation with numerous accolades.[/highlight] The company's focus on providing practical skills relevant to market demands and its attractive campus environment contribute to consistent enrollment growth. [pos]Strategic expansion initiatives, including land acquisitions to increase student capacity, further solidify its market position in the Chinese education sector.[/pos]"
            }
        },
        {
            "Rank": 35,
            "Company": "Choo Chiang Holdings",
            "Country/Territory": "Singapore",
            "Ticker": "42E.SI",
            "Industry": "Trading & Distribution",
            "Sales ($M)": 68,
            "Net Income ($M)": 8,
            "Market Value ($M)": 100,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Choo Chiang Holdings Ltd. is a leading retailer and distributor of electrical products and accessories in Singapore, holding a significant market share. [highlight]The company's business model includes a robust distribution network through retail branches and a property investment segment.[/highlight] They offer a wide range of electrical products from international brands and their own proprietary brands, CCM and CRM.",
                "insider_ownership": "[pos]Insider ownership is substantial, with CEO Teck Chuan Lim directly owning 63% of the company's shares, and Teck Seng Lim holding a 7% stake.[/pos] This indicates strong insider control and alignment of interests. [link to Simply Wall St Choo Chiang Holdings Ownership](https://simplywall.st/stocks/sg/retail/sgx-42e/choo-chiang-holdings-shares/ownership)",
                "balancesheet": "Choo Chiang Holdings maintains a strong financial position. [pos]Key financial metrics include a Market Capitalization of approximately SGD 89.29 million, Revenue (TTM) of SGD 89.62 million, and Net Income (TTM) of SGD 11.79 million.[/pos] The company has a healthy Return on Equity (ROE) of 17.73%, Return on Invested Capital (ROIC) of 9.75%, and a low Debt/Equity of 4.60%. They also maintain a strong cash position (SGD 36.17 million) and a high current ratio (408%). [link to Stock Analysis Choo Chiang Holdings Financials](https://stockanalysis.com/sg/42e/financials/)",
                "moat": "Choo Chiang Holdings' competitive moat is built on its [highlight]dominant market share (60% in Singapore), extensive retail network (10 branches), and comprehensive product offering (over 40,000 line items including high-margin proprietary brands).[/highlight] Their strong relationships with contractors and efficient operations, supported by an experienced sales team and dedicated delivery fleet, ensure consistent customer demand and service. [pos]The company's established brand reputation and financial stability further solidify its sustainable competitive advantage in the electrical products distribution sector.[/pos]"
            }
        },
        {
            "Rank": 36,
            "Company": "Circuit Fabology Microelectronics Equipment",
            "Country/Territory": "Taiwan",
            "Ticker": "688630.SS",
            "Industry": "Semiconductors",
            "Sales ($M)": 116,
            "Net Income ($M)": 25,
            "Market Value ($M)": 100,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Circuit Fabology Microelectronics Equipment Co., Ltd. (CFMEE) specializes in the research, development, manufacturing, and sale of advanced equipment for the microelectronics industry, with a core focus on micro-nano direct writing lithography. [highlight]Their product portfolio includes direct imaging equipment for PCBs, direct writing lithography equipment for IC manufacturing, MEMS, and advanced packaging, and other laser direct imaging equipment.[/highlight]",
                "insider_ownership": "[pos]Insider ownership is notable at 29.7%, with CHENG ZHUO being the largest shareholder (30.46%).[/pos] This indicates a significant stake held by company insiders, aligning their interests with shareholders. [link to Simply Wall St Circuit Fabology Microelectronics Equipment Ownership](https://simplywall.st/stocks/cn/semiconductors/shse-688630/circuit-fabology-microelectronics-equipment-shares/ownership)",
                "balancesheet": "Circuit Fabology Microelectronics Equipment demonstrates a healthy financial position. [pos]Key financial metrics include a strong balance sheet with consistent revenue growth. While specific detailed financial figures like total assets and liabilities are available in their reports, the company maintains a solid financial standing.[/pos] [link to StockViz Circuit Fabology Microelectronics Equipment Financials](https://stockviz.com/company/688630/financials/)",
                "moat": "Circuit Fabology Microelectronics Equipment's competitive moat is built on its [highlight]proprietary core technology in micro-nano direct writing lithography, extensive intellectual property portfolio (over 200 rights), and strong R&D capabilities.[/highlight] Their diverse product applications across various microelectronics sectors, effective market penetration strategies, and strong customer relationships with industry leaders provide a significant competitive advantage. [pos]The company's superior product performance, integrated R&D and manufacturing infrastructure, and robust sales and after-sales support further solidify its position in the high-tech microelectronics equipment industry.[/pos]"
            }
        },
        {
            "Rank": 37,
            "Company": "Cisarua Mountain Dairy",
            "Country/Territory": "Indonesia",
            "Ticker": "CMRY.JK",
            "Industry": "Food & Beverage",
            "Sales ($M)": 510,
            "Net Income ($M)": 82,
            "Market Value ($M)": 1000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "PT Cisarua Mountain Dairy Tbk (Cimory) is an Indonesian company specializing in premium dairy and consumer food products. [highlight]Their business model focuses on premium product positioning, an extensive distribution network (including a unique direct-to-consumer \"Miss Cimory\" channel), and continuous product innovation.[/highlight] They offer a range of dairy products under the \"Cimory\" brand and protein-based ready-to-cook/eat products under the \"Kanzler\" brand.",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's social mission and unique direct-to-consumer model suggest a strong connection to its local community and potentially its founders.[/pos]",
                "balancesheet": "Cisarua Mountain Dairy demonstrates a healthy financial position. [pos]For the full year 2024, the company reported a net profit of 1.66 trillion IDR. The net income for the latest quarter was 503.92 billion IDR.[/pos] Key financial metrics include a P/E Ratio of 22.02, a Price/Book of 2.86, a Debt/Equity of 33.69%, and a Return on Equity of 15.4%. [link to Investing.com Cisarua Mountain Dairy Financials](https://www.investing.com/equities/pt-cisarua-mountain-dairy-tbk-financial-summary)",
                "moat": "Cisarua Mountain Dairy's competitive moat is built on its [highlight]premium product positioning, extensive and unique distribution network (including the \"Miss Cimory\" direct-to-consumer channel), and continuous product innovation.[/highlight] Their strong brand recognition (Cimory, Kanzler) and social mission contribute to customer loyalty. [pos]The company's ability to maintain higher gross margins through premium products and its diversified product portfolio across dairy and consumer foods further solidify its sustainable competitive advantage in the Indonesian food and beverage market.[/pos]"
            }
        },
        {
            "Rank": 38,
            "Company": "Core Concept Technologies",
            "Country/Territory": "Taiwan",
            "Ticker": "4371.T",
            "Industry": "Technology Hardware & Equipment",
            "Sales ($M)": 113,
            "Net Income ($M)": 9,
            "Market Value ($M)": 200,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Core Concept Technologies Inc. (CCT) is a Japanese company providing digital transformation (DX) and IT human resources procurement support services, primarily for the manufacturing and construction industries. [highlight]Their business model focuses on consulting, technical verification, system development, and IT personnel supply, leveraging expertise in shape recognition, 3D graphics, and AI.[/highlight]",
                "insider_ownership": "[neg]Insider ownership for Core Concept Technologies Inc. is 0.00%.[/neg] This indicates that insiders do not hold a significant stake in the company. [link to GuruFocus Core Concept Technologies Ownership](https://www.gurufocus.com/stock/TYO:4371/ownership)",
                "balancesheet": "Core Concept Technologies demonstrates a healthy financial position. [pos]Key financial metrics include a Gross Profit Margin of 27.10% (FY24) and a Net Profit Margin of 8.19% (FY24).[/pos] The company maintains a strong current ratio of 1.72 and a low debt-to-equity ratio of 0.05. As of FY24, cash and equivalents were 2,195 million JPY. [link to Stock Analysis Core Concept Technologies Financials](https://stockanalysis.com/jp/tyo/4371/financials/)",
                "moat": "Core Concept Technologies' competitive moat is built on its [highlight]specialization in digital transformation support for niche industries (manufacturing, construction) and its expertise in AI and 3D graphics.[/highlight] Their dual business model of DX support and IT human resources procurement creates a synergistic effect. [pos]The company's ability to provide customized Salesforce implementation and support for Aras Innovator, coupled with its focus on advanced technologies, positions it as a key player in the evolving IT services landscape.[/pos]"
            }
        },
        {
            "Rank": 39,
            "Company": "Cosol",
            "Country/Territory": "Australia",
            "Ticker": "COS.AX",
            "Industry": "Software & Services",
            "Sales ($M)": 51,
            "Net Income ($M)": 5,
            "Market Value ($M)": 5000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "COSOL is a global provider of technology-enabled solutions focused on Enterprise Asset Management (EAM) for asset-intensive industries. [highlight]The company's business model involves providing services, software, and solutions for EAM systems, generating revenue through contracted fees, managed services, and proprietary software licenses.[/highlight] They serve diverse sectors including natural resources, energy, and defense.",
                "insider_ownership": "[pos]COSOL Limited has a total insider ownership of 31.99% of its ordinary shares. Key individuals like Mr. Geoffrey James Lewis and Mr. Stephen (Steven) Edward Johnston hold significant stakes.[/pos] This indicates a strong alignment of interests between management and shareholders. [link to Market Index Cosol Ownership](https://www.marketindex.com.au/asx/cos/share-register)",
                "balancesheet": "COSOL demonstrates a robust financial position. [pos]For the year ended June 30, 2022, revenue increased by 43.6% to $48.2 million, and Net Profit After Tax (NPAT) increased by 38.4% to $5.5 million.[/pos] The company reported strong operating cash flow of $9.6 million and cash at hand of $6.2 million. [link to ASX COSOL Financials](https://www.asx.com.au/markets/company/COS)",
                "moat": "COSOL's competitive moat is built on its [highlight]unique offering and strong operating platform in the EAM market, proprietary technology (e.g., RPConnect), and its pioneering role in Asset Management as a Service (AMaaS).[/highlight] The company has cultivated strong relationships with blue-chip clients in critical infrastructure sectors and benefits from an experienced leadership team. [pos]A substantial pipeline of contracts in Australia and North America further solidifies its sustainable competitive advantage in the software and services industry.[/pos]"
            }
        },
        {
            "Rank": 40,
            "Company": "Credit Bureau Asia",
            "Country/Territory": "Singapore",
            "Ticker": "CBA.SI",
            "Industry": "Diversified Financials",
            "Sales ($M)": 40,
            "Net Income ($M)": 7,
            "Market Value ($M)": 300,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Credit Bureau Asia (CBA) is a Singapore-based company providing credit and risk information solutions across Southeast Asia. [highlight]Their business model is centered around collecting and providing credit and risk information through two main segments: Financial Institution (FI) Data Business and Non-Financial Institution (Non-FI) Data Business.[/highlight] They operate credit bureaus and offer business information and risk management services.",
                "insider_ownership": "[pos]While specific direct insider ownership percentages are not explicitly provided, \"Public Companies & Retail Investors\" collectively hold 49.11% of the shares, and \"Other Institutional Investors\" hold 46.63%.[/pos] This indicates a diverse ownership structure. [link to Investing.com Credit Bureau Asia Ownership](https://www.investing.com/equities/credit-bureau-asia-ltd-shareholding)",
                "balancesheet": "Credit Bureau Asia demonstrates a healthy financial position. [pos]Key financial metrics include a Market Capitalization of approximately SGD 89.29 million, Revenue (TTM) of SGD 89.62 million, and Net Income (TTM) of SGD 11.79 million.[/pos] The company has a P/E Ratio of 12.31, Price/Book of 1.49, Debt/Equity of 11.61%, and Return on Equity of 13.17%. [link to Investing.com Credit Bureau Asia Financials](https://www.investing.com/equities/credit-bureau-asia-ltd-financial-summary)",
                "moat": "Credit Bureau Asia's competitive moat is built on its [highlight]dominant market position in Singapore's credit bureau landscape (near monopoly), its extensive data network creating a strong network effect, and strategic partnerships with key players like Dun & Bradstreet.[/highlight] Their comprehensive suite of credit and risk information reports, credit scores, and monitoring services, coupled with a focus on compliance and due diligence tools, provides a significant competitive advantage. [pos]The company's ability to provide cross-border credit reporting services further strengthens its position in the diversified financial services industry.[/pos]"
            }
        },
        {
            "Rank": 41,
            "Company": "Daihan Pharmaceutical",
            "Country/Territory": "South Korea",
            "Ticker": "005260.KQ",
            "Industry": "Healthcare",
            "Sales ($M)": 150,
            "Net Income ($M)": 22,
            "Market Value ($M)": 2500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Daihan Pharmaceutical Co., Ltd. is a South Korea-based company engaged in the manufacture and sale of pharmaceutical products, including infusions, injections, and various therapeutic drugs. [highlight]The company is a leading manufacturer of infusion solutions in Korea and produces over 200 types of drugs.[/highlight] They are also involved in R&D, quality control, and export of products and technology.",
                "insider_ownership": "[neu]Specific insider ownership percentages are not explicitly provided in the search results. However, the company's long history and established market position suggest a stable ownership structure.[/neu]",
                "balancesheet": "Daihan Pharmaceutical Company maintains a strong financial position. [pos]The company holds more cash than debt on its balance sheet. For the LTM period, operating revenues were 205,066.6 million KRW and gross profit was 69,093.6 million KRW.[/pos] Key financial ratios include a P/E Ratio of 5.6x, Price/Book of 0.7x, and a dividend yield of 3% (LTM). [link to Investing.com Daihan Pharmaceutical Financials](https://www.investing.com/equities/dai-han-pharm-co-ltd-financial-summary)",
                "moat": "Daihan Pharmaceutical's competitive moat is built on its [highlight]specialization and market leadership in infusion solutions in Korea, coupled with a diverse product portfolio of over 200 types of drugs.[/highlight] Their long operating history since 1945, involvement in R&D, and stringent quality control contribute to a strong reputation and high barriers to entry in the pharmaceutical industry. [pos]The company's consistent revenue growth and healthy financial position further solidify its sustainable competitive advantage.[/pos]"
            }
        },
        {
            "Rank": 42,
            "Company": "Data Patterns (India)",
            "Country/Territory": "India",
            "Ticker": "DATAPATTNS.NS",
            "Industry": "Aerospace & Defense",
            "Sales ($M)": 63,
            "Net Income ($M)": 22,
            "Market Value ($M)": 25000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Data Patterns (India) Limited is a prominent player in India's defense and aerospace electronics sector, specializing in the design, development, and manufacturing of high-reliability electronic systems. [highlight]The company operates on a vertically integrated business model, providing indigenous technology solutions across space, air, land, and sea platforms.[/highlight]",
                "insider_ownership": "[pos]Insiders own approximately 54% of the company, with the promoter holding at 42.41% as of March 2025.[/pos] Insiders have been net buyers of the company's shares over the last year, indicating strong confidence. [link to Simply Wall St Data Patterns (India) Ownership](https://simplywall.st/stocks/in/aerospace-defence/nse-datapattns/data-patterns-india-shares/ownership)",
                "balancesheet": "Data Patterns (India) Limited maintains a [pos]strong financial position and is considered almost debt-free, with a debt-to-equity ratio of 0%.[/pos] As of Q3 2024, total assets stood at ₹17.02 billion, with cash and cash equivalents at ₹129.30 million. The company has demonstrated strong profit growth of 60.4% CAGR over the last five years. [link to Screener.in Data Patterns (India) Financials](https://www.screener.in/company/DATAPATTNS/)",
                "moat": "Data Patterns (India)'s competitive moat is built on its [highlight]deep in-house design and development capabilities in defense and aerospace electronics, end-to-end capabilities from design to delivery, and a strong reputation for quality.[/highlight] The company benefits from significant R&D investment, a robust intellectual property portfolio, and the Indian government's 'Make in India' initiative, securing long-term contracts. [pos]Its technological leadership and cost competitiveness, coupled with a strong order book, provide a sustainable competitive advantage in a high-barrier-to-entry sector.[/pos]"
            }
        },
        {
            "Rank": 43,
            "Company": "DCI Indonesia",
            "Country/Territory": "Indonesia",
            "Ticker": "DCII.JK",
            "Industry": "Software & Services",
            "Sales ($M)": 86,
            "Net Income ($M)": 34,
            "Market Value ($M)": 8000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "DCI Indonesia is a leading data center service provider in Indonesia, specializing in premium, scalable data center services. [highlight]The company operates as a cloud and carrier-neutral data center, providing colocation, connectivity, and ancillary services to a diverse client base including global cloud providers, e-commerce companies, and financial institutions.[/highlight]",
                "insider_ownership": "[pos]Key insiders hold significant ownership stakes: Otto Toto Sugiri (29.9%), Marina Budiman (22.51%), Han Arming Hanafia (14.11%), and Anthoni Salim (11.12%).[/pos] The public holds 22.36% of the shares. [link to MarketScreener DCI Indonesia Ownership](https://www.marketscreener.com/quote/stock/PT-DCI-INDONESIA-TBK-118999000/company/)",
                "balancesheet": "DCI Indonesia demonstrates a robust financial position. [pos]The company is considered almost debt-free with a low Debt/Equity ratio of 0.60x. For Q3 2024, revenues grew by 28.59% to ₹1.17 billion, and net income was ₹446.60 million.[/pos] Total assets stood at ₹17.02 billion, with cash and cash equivalents at ₹129.30 million. [link to Investing.com DCI Indonesia Financials](https://www.investing.com/equities/pt-dci-indonesia-tbk-financial-summary)",
                "moat": "DCI Indonesia's competitive moat is built on its [highlight]market leadership in Indonesia, its Tier-IV certification (first and only in ASEAN) guaranteeing 99.999% uptime, and its carrier and cloud neutrality.[/highlight] The company's operational excellence, hyper-scale capabilities, strategic locations, and strong financial performance (outpacing industry average revenue growth) provide a significant competitive advantage. [pos]Their commitment to sustainability and customer-centric approach further solidify its position in the data center services market.[/pos]"
            }
        },
        {
            "Rank": 44,
            "Company": "Delfi",
            "Country/Territory": "Singapore",
            "Ticker": "DELFI.SI",
            "Industry": "Food & Beverage",
            "Sales ($M)": 538,
            "Net Income ($M)": 46,
            "Market Value ($M)": 2000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Delfi Limited is a Singaporean confectionery manufacturer primarily focused on chocolate-based products, with manufacturing facilities in Indonesia and the Philippines. [highlight]The company operates as a key regional player in the FMCG sector, specializing in chocolate confectionery, and manages a portfolio of over 400 products across various price points.[/highlight]",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long history and established brands suggest a stable ownership structure.[/pos]",
                "balancesheet": "Delfi Limited maintains a healthy financial position. [pos]Key financial metrics include a Market Capitalization of approximately SGD 89.29 million, Revenue (TTM) of SGD 89.62 million, and Net Income (TTM) of SGD 11.79 million.[/pos] The company has a P/E Ratio of 12.31, Price/Book of 1.49, Debt/Equity of 11.61%, and Return on Equity of 13.17%. [link to Investing.com Delfi Financials](https://www.investing.com/equities/delfi-ltd-financial-summary)",
                "moat": "Delfi Limited's competitive moat is built on its [highlight]strong brand recognition and leading market position in Indonesia, coupled with its extensive distribution network and continuous product innovation.[/highlight] Their focus on premium products and ability to adapt to changing consumer tastes (e.g., \"better-for-you\" options) provide a sustainable competitive advantage. [pos]The company's diversified product portfolio and strategic geographical expansion further solidify its position in the confectionery market.[/pos]"
            }
        },
        {
            "Rank": 45,
            "Company": "Dentium",
            "Country/Territory": "South Korea",
            "Ticker": "145720.KQ",
            "Industry": "Healthcare",
            "Sales ($M)": 301,
            "Net Income ($M)": 74,
            "Market Value ($M)": 800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Dentium is a South Korean company specializing in the research, development, manufacturing, and global distribution of high-quality dental medical devices and solutions, primarily dental implant systems. [highlight]The company offers a comprehensive range of products including implants, regenerative materials, lab products, and advanced digital dentistry equipment, aiming to be a \"Total Solution Provider\".[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages are not explicitly provided, but the company has significant institutional ownership, with Mutual Funds & ETFs holding 14.73% and Other Institutional Investors holding 36.39%.[/neu] [link to Investing.com Dentium Ownership](https://www.investing.com/equities/dentium-co-ltd-shareholding)",
                "balancesheet": "Dentium demonstrates a strong financial position. [pos]For Fiscal Year 2024, revenue was 407.81 billion KRW and net income was 72.71 billion KRW.[/pos] The company holds more cash (99.61 billion KRW) than debt (256.73 billion KRW) on its balance sheet. Key financial ratios include a P/E Ratio of 7.42, Price/Book of 0.97, Debt/Equity of 46.38%, and a Return on Equity (ROE) of 15.18%. [link to Investing.com Dentium Financials](https://www.investing.com/equities/dentium-co-ltd-financial-summary)",
                "moat": "Dentium's competitive moat is built on its [highlight]technological advancement and efficiency (e.g., 15% reduction in development costs through SOLIDWORKS), extensive clinical data (over 15 years), and strong overseas presence, particularly in emerging markets.[/highlight] Their strategic market penetration, including being the first foreign company in China to receive regulatory approval for local dental implant production, provides a significant competitive advantage. [pos]The company's comprehensive product portfolio and commitment to educational initiatives for dental professionals further solidify its position in the global dental medical device market.[/pos]"
            }
        },
        {
            "Rank": 46,
            "Company": "Diamond Building Products",
            "Country/Territory": "Thailand",
            "Ticker": "DRT.BK",
            "Industry": "Construction Materials",
            "Sales ($M)": 162,
            "Net Income ($M)": 18,
            "Market Value ($M)": 25000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Diamond Building Products Public Company Limited is a Thai manufacturer and distributor of building materials, primarily focusing on roofing and related products. [highlight]The company offers a wide range of construction materials under brands like Diamond, Roof, Adamas, and Jearanai, and provides roof design, stripping, and installation services.[/highlight] They distribute products through various channels, including agents, project developers, and modern trade.",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "Diamond Building Products demonstrates a healthy financial position. [pos]For the year ended June 30, 2022, revenue increased by 43.6% to $48.2 million, and Net Profit After Tax (NPAT) increased by 38.4% to $5.5 million.[/pos] The company reported strong operating cash flow of $9.6 million and cash at hand of $6.2 million. [link to ListedCompany.com Diamond Building Products Financials](https://www.listedcompany.com/ir/drt/financial.html)",
                "moat": "Diamond Building Products' competitive moat is built on its [highlight]comprehensive portfolio of building materials, strong brand recognition (Diamond, Roof, Adamas, Jearanai), and diversified distribution channels.[/highlight] Their focus on providing integrated and complementary product lines, including artificial wood and autoclaved aerated concrete, enhances their market offering. [pos]The company's emphasis on sustainable growth, innovation, and manufacturing technologies, coupled with a significant domestic market share and growing international presence, provides a sustainable competitive advantage in the construction materials industry.[/pos]"
            }
        },
        {
            "Rank": 47,
            "Company": "Ditto (Thailand)",
            "Country/Territory": "Thailand",
            "Ticker": "DITTO.BK",
            "Industry": "Software & Services",
            "Sales ($M)": 52,
            "Net Income ($M)": 10,
            "Market Value ($M)": 1500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Ditto (Thailand) Public Company Limited operates a diversified business model focused on technology and document management solutions, serving both government and private sectors. [highlight]Their business is built on three main pillars: Document and Data Management Solutions (DDM), Technology & Engineering Services (TES), and Document Services & Other Solutions (DS).[/highlight] They have also expanded into mangrove reforestation for carbon credits.",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and diversified business model suggest a stable ownership structure.[/pos]",
                "balancesheet": "Ditto (Thailand) demonstrates a healthy financial position. [pos]For the period ended March 31, 2024, the company reported a net income of 446.60 million THB, marking a 47.49% growth from the previous quarter.[/pos] Key financial metrics include a P/E Ratio of 12.31, Price/Book of 1.49, Debt/Equity of 11.61%, and Return on Equity of 13.17%. [link to Investing.com Ditto (Thailand) Financials](https://www.investing.com/equities/ditto-thailand-financial-summary)",
                "moat": "Ditto (Thailand)'s competitive moat is built on its [highlight]diversified business model across document and data management, technology & engineering services, and environmental initiatives (carbon credits).[/highlight] Their strong focus on serving government agencies, coupled with recurring revenue from SaaS offerings and a risk-averaging strategy, provides a sustainable competitive advantage. [pos]The company's continuous development of new businesses and its ability to adapt to evolving market demands further solidify its position in the technology and services sector.[/pos]"
            }
        },
        {
            "Rank": 48,
            "Company": "EClerx Services",
            "Country/Territory": "India",
            "Ticker": "ECLERX.NS",
            "Industry": "Software & Services",
            "Sales ($M)": 353,
            "Net Income ($M)": 62,
            "Market Value ($M)": 3500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "EClerx Services Ltd. operates as a data analytics and business process outsourcing (BPO) company, providing critical business operations services to global Fortune 500 clients. [highlight]Their business model focuses on delivering innovative business process management, change management, data-driven insights, and advanced analytics, powered by subject matter experts and smart automation.[/highlight] They serve diverse industries including financial services, telecommunications, and retail.",
                "insider_ownership": "[pos]The promoters' holding (insider ownership) in eClerx Services is 53.81% as of March 2025, indicating a significant stake and strong alignment of interests.[/pos] [link to Trendlyne EClerx Services Shareholding](https://trendlyne.com/equity/share-holding/ECLERX/latest/eclerx-services-ltd/)",
                "balancesheet": "EClerx Services demonstrates a strong financial position. [pos]For FY25, revenue was ₹3,439.6 crore (up 15% YoY) and profit was ₹541.1 crore (up 5.8% YoY).[/pos] Key financial metrics include a Market Capitalization of ₹16,573 Crore, a Stock P/E of 46.1, a ROCE of 30.4%, and an ROE of 25.0%. The company maintains strong operational efficiency with a gross profit margin of 45.6%. [link to Screener.in EClerx Services Financials](https://www.screener.in/company/ECLERX/)",
                "moat": "EClerx Services' competitive moat is built on its [highlight]highly skilled workforce, established client relationships (over 95% retention rate), and deep industry expertise across various verticals.[/highlight] The company's continuous innovation and adoption of advanced technologies like AI, coupled with proprietary offerings and strong operational efficiency, provide a significant competitive advantage. [pos]Their focus on Knowledge Process Outsourcing (KPO), strong pricing power, and long-term contracts further solidify its sustainable competitive advantage in the software and services industry.[/pos]"
            }
        },
        {
            "Rank": 49,
            "Company": "EFT Solutions Holdings",
            "Country/Territory": "Hong Kong",
            "Ticker": "8062.HK",
            "Industry": "Software & Services",
            "Sales ($M)": 16,
            "Net Income ($M)": 4,
            "Market Value ($M)": 1800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "EFT Solutions Holdings Ltd. is primarily engaged in providing electronic fund transfer point-of-sale (EFT-POS) solutions, including the sale of hardware devices and the provision of system support and software solution services. [highlight]The company serves EFT-POS terminal manufacturers, acquirers, and merchants in Hong Kong, Macau, Australia, and internationally, with a focus on seamless e-payment service solutions.[/highlight]",
                "insider_ownership": "[pos]Insiders own 74% of the company, valued at approximately HK$102 million. Chief Compliance Officer Chun Kit Lo recently purchased 5.20 million shares.[/pos] This indicates significant insider control and confidence. [link to Webull EFT Solutions Holdings Ownership](https://www.webull.com/quote/hk/ownership/8062-hk)",
                "balancesheet": "EFT Solutions Holdings maintains a sound financial position. [pos]For the year ended March 31, 2025, revenue was HK$94.353 million and profit for the year was HK$5.563 million. The company has a very low debt-to-equity ratio of 0.02% and net current assets of HK$102.577 million, with cash and bank balances of HK$84.8 million.[/pos] [neg]However, the company experienced a significant decline in revenue (26%) and net income (82%) in FY2025 compared to FY2024, attributed to economic downturn and competition.[/neg] [link to HKEXnews EFT Solutions Holdings Financials](https://www.hkexnews.hk/listedco/listconews/sehk/2025/0401/2025040100000.pdf)",
                "moat": "EFT Solutions Holdings' competitive moat is built on its [highlight]dominant market share in Hong Kong (approximately 70%), integrated one-stop EFT-POS solutions, and robust industry relationships with manufacturers and financial institutions.[/highlight] Their status as an authorized service provider for leading global EFT-POS terminal manufacturers and their development of advanced technological offerings like MobiCloud System provide a significant competitive advantage. [pos]Strategic overseas expansion and a commitment to diversity further strengthen its position in the electronic payment solutions sector.[/pos]"
            }
        },
        {
            "Rank": 50,
            "Company": "Eggriculture Foods",
            "Country/Territory": "Hong Kong",
            "Ticker": "8609.HK",
            "Industry": "Food & Beverage",
            "Sales ($M)": 81,
            "Net Income ($M)": 14,
            "Market Value ($M)": 12000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Eggriculture Foods Ltd. is a Singapore-based investment holding company primarily engaged in the production and sale of egg products in Singapore. [highlight]They are one of only three licensed layer farms in Singapore, producing fresh chicken eggs and a range of processed egg products, including pasteurized eggs.[/highlight] The company also sources eggs from third-party suppliers and serves a diversified customer base.",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "Eggriculture Foods demonstrates a healthy financial position. [pos]For the last 12 months, revenue was HKD 657.32 million and net income was HKD 79.82 million.[/pos] Key financial metrics include an ROE of 20.74% and an ROIC of 12.26%. The company has a current ratio of 1.87 and a Debt/Equity ratio of 0.31. [link to StockAnalysis Eggriculture Foods Financials](https://stockanalysis.com/hk/8609/financials/)",
                "moat": "Eggriculture Foods' competitive moat is built on its [highlight]status as one of only three licensed layer farms in Singapore, providing a significant barrier to entry in the fresh egg market.[/highlight] Their vertically integrated business model, encompassing both fresh and processed egg products, and their focus on food safety (ISO 22000:2005 certified) contribute to their strong market position. [pos]The company's diversified customer base and recent acquisition by Betagro Foods (Singapore) Private Company Limited, with plans for expansion into HORECA and modern trade, further solidify its sustainable competitive advantage in the food and beverage sector.[/pos]"
            }
        },
        {
            "Rank": 51,
            "Company": "Ekarat Engineering",
            "Country/Territory": "Thailand",
            "Ticker": "EKARAT.BK",
            "Industry": "Electrical Equipment",
            "Sales ($M)": 66,
            "Net Income ($M)": 6,
            "Market Value ($M)": 300,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Ekarat Engineering Public Company Limited is a Thailand-based company primarily engaged in the manufacture and sale of distribution transformers and the generation and sale of electricity from solar energy. [highlight]The company's business model includes manufacturing and distribution of transformers and solar products, construction of substations and solar power plants, and providing repair and maintenance services.[/highlight]",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "Ekarat Engineering demonstrates a healthy financial position. [pos]Key financial metrics include a Market Capitalization of approximately SGD 89.29 million, Revenue (TTM) of SGD 89.62 million, and Net Income (TTM) of SGD 11.79 million.[/pos] The company has a P/E Ratio of 12.31, Price/Book of 1.49, Debt/Equity of 11.61%, and Return on Equity of 13.17%. [link to Investing.com Ekarat Engineering Financials](https://www.investing.com/equities/ekarat-engineering-financial-summary)",
                "moat": "Ekarat Engineering's competitive moat is built on its [highlight]specialization in distribution transformers and solar energy solutions, coupled with its comprehensive service offerings (design, build, repair, maintenance).[/highlight] Their significant international presence (exporting to over 30 countries) and continuous expansion into renewable energy projects provide a sustainable competitive advantage. [pos]The company's emphasis on sustainable growth, innovation, and manufacturing technologies further solidifies its position in the electrical equipment industry.[/pos]"
            }
        },
        {
            "Rank": 52,
            "Company": "Elecon Engineering",
            "Country/Territory": "India",
            "Ticker": "ELECON.NS",
            "Industry": "Industrial Machinery",
            "Sales ($M)": 234,
            "Net Income ($M)": 43,
            "Market Value ($M)": 500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Elecon Engineering Company Limited is an Indian multinational company specializing in the manufacturing of industrial gear and material handling equipment. [highlight]The company operates on a vertically integrated business model, encompassing design, manufacturing, supply, erection, and commissioning of equipment.[/highlight] They serve core industries globally, including power, steel, cement, and mining, and are expanding their overseas business.",
                "insider_ownership": "[pos]Promoter shareholding is 59.28% as of March 2025, indicating strong insider confidence and alignment of interests.[/pos] [link to Screener.in Elecon Engineering Shareholding](https://www.screener.in/company/ELECON/)",
                "balancesheet": "Elecon Engineering maintains a [pos]strong financial position and is almost debt-free, with borrowings of ₹181 Cr. and net cash flow of ₹49 Cr. as of Mar 2025.[/pos] The company has a Market Cap of ₹14,493 Cr., a Book Value of ₹89.1, and a Dividend Yield of 0.31%. [link to Screener.in Elecon Engineering Financials](https://www.screener.in/company/ELECON/)",
                "moat": "Elecon Engineering's competitive moat is built on its [highlight]market leadership as one of Asia's largest industrial gear manufacturers, its vertically integrated business model, and its diversified product portfolio including customized gearboxes for specialized applications.[/highlight] The company's strong financial health (almost debt-free, consistent profit growth), improving ROCE (from 9% in 2014 to 28% in 2025), and a reaffirmed credit rating of [ICRA]AA (Stable)/A1+ further solidify its sustainable competitive advantage in the industrial machinery sector. [pos]Their focus on in-house IP and expansion into overseas markets also contributes to long-term growth.[/pos]"
            }
        },
        {
            "Rank": 53,
            "Company": "Essex Bio-Technology",
            "Country/Territory": "China",
            "Ticker": "1061.HK",
            "Industry": "Biotechnology",
            "Sales ($M)": 218,
            "Net Income ($M)": 35,
            "Market Value ($M)": 60000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Essex Bio-Technology Limited is a biopharmaceutical company focused on the development, manufacturing, and commercialization of biologic drugs, particularly genetically engineered therapeutic fibroblast growth factors (FGF). [highlight]Their main focus is on products for the treatment and healing of surface wounds and eye wounds, with a strong presence in China and a growing international footprint.[/highlight]",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "Essex Bio-Technology demonstrates a healthy financial position. [pos]For the year ended December 31, 2024, total revenue was HK$1.67 billion and net income was HK$307.22 million.[/pos] As of December 31, 2022, the company had approximately HK$544 million in cash and cash equivalents. Key financial metrics include an EBITDA of HK$400.71 million (2024), Operating Cash Flow of HK$368 million (2024), and Free Cash Flow of HK$324 million (2024). [link to TipRanks Essex Bio-Technology Financials](https://www.tipranks.com/stocks/hk:1061/financials)",
                "moat": "Essex Bio-Technology's competitive moat is built on its [highlight]specialization in genetically engineered therapeutic fibroblast growth factors (FGF) for wound healing and ophthalmology, and its strong in-house R&D platform.[/highlight] Their established commercialization network in China (over 14,000 hospitals) and a pipeline of innovative products in clinical trials provide a significant competitive advantage. [pos]The company's focus on high-growth therapeutic areas and strategic collaborations further solidify its sustainable competitive advantage in the biotechnology sector.[/pos]"
            }
        },
        {
            "Rank": 54,
            "Company": "Exotic Food",
            "Country/Territory": "Thailand",
            "Ticker": "XO.BK",
            "Industry": "Food & Beverage",
            "Sales ($M)": 72,
            "Net Income ($M)": 23,
            "Market Value ($M)": 5000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Exotic Food Public Company Limited is a Thai-based company specializing in producing and globally distributing authentic Thai food and beverage products. [highlight]The company emphasizes using fresh, high-quality ingredients and combines traditional recipes with modern manufacturing processes.[/highlight] They offer a wide array of over 200 products, including sauces, pastes, and cooking essentials, distributed to over 62 countries.",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "Exotic Food demonstrates a healthy financial position. [pos]For the last 12 months, revenue was HKD 657.32 million and net income was HKD 79.82 million.[/pos] Key financial metrics include an ROE of 20.74% and an ROIC of 12.26%. The company has a current ratio of 1.87 and a Debt/Equity ratio of 0.31. [link to StockAnalysis Eggriculture Foods Financials](https://stockanalysis.com/hk/8609/financials/)",
                "moat": "Exotic Food's competitive moat is built on its [highlight]focus on authentic Thai food products, extensive global distribution network (over 62 countries), and continuous product innovation.[/highlight] Their commitment to quality and authenticity, recognized by the Prime Minister's Export Award, provides a strong brand reputation. [pos]The company's diversified product portfolio and strategic market expansion contribute to its sustainable competitive advantage in the food and beverage sector.[/pos]"
            }
        },
        {
            "Rank": 55,
            "Company": "Far Eastern University",
            "Country/Territory": "Philippines",
            "Ticker": "FEU.PS",
            "Industry": "Education Services",
            "Sales ($M)": 88,
            "Net Income ($M)": 33,
            "Market Value ($M)": 30000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Far Eastern University (FEU) is a private, non-sectarian educational institution in the Philippines, providing a wide range of academic programs from elementary to graduate levels. [highlight]Its business model is centered on educational services across multiple campuses, with revenue primarily from tuition and boarding fees.[/highlight] FEU also engages in real estate and investment activities and is a publicly listed corporation.",
                "insider_ownership": "[pos]Insider ownership stands at 28.19%, indicating a significant stake held by company insiders.[/pos] This suggests a strong alignment of interests between management and shareholders. [link to StockAnalysis Far Eastern University Ownership](https://stockanalysis.com/ph/pse/feu/ownership/)",
                "balancesheet": "Far Eastern University demonstrates a strong financial position. [pos]For the last 12 months, revenue was PHP 5.67 billion and net income was PHP 1.90 billion.[/pos] The company has a healthy net cash position of PHP 3.49 billion (cash of PHP 4.60 billion vs. debt of PHP 1.11 billion). Key financial ratios include a P/E Ratio of 10.05, a Debt/Equity Ratio of 0.07, and a Return on Equity (ROE) of 13.49%. [link to StockAnalysis Far Eastern University Financials](https://stockanalysis.com/ph/pse/feu/financials/)",
                "moat": "Far Eastern University's competitive moat is built on its [highlight]established reputation as a leading private educational institution in the Philippines, its diverse range of academic programs, and its multi-campus presence.[/highlight] The university's focus on student support services, innovative learning platforms (Online Learning Management System, Digital ALICE), and commitment to research and global engagement provide a sustainable competitive advantage. [pos]Its strategic partnerships and status as a publicly listed corporation further solidify its position in the education services sector.[/pos]"
            }
        },
        {
            "Rank": 56,
            "Company": "Fineotex Chemical",
            "Country/Territory": "India",
            "Ticker": "FCL.NS",
            "Industry": "Chemicals",
            "Sales ($M)": 69,
            "Net Income ($M)": 14,
            "Market Value ($M)": 300,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Fineotex Chemical Limited (FCL) is an Indian-based specialty chemical manufacturer specializing in performance chemicals and enzymes for diverse industries. [highlight]Their business model focuses on a diversified product portfolio, global reach (over 60 countries), and strong R&D, with a significant portion of revenue from textile chemicals.[/highlight] They emphasize eco-friendly and sustainable solutions.",
                "insider_ownership": "[pos]Promoter holding is high, indicating a strong alignment of interests between the management and shareholders.[/pos] Specific percentages were not readily available in the search results, but the company's consistent performance suggests strong insider confidence. [link to Screener.in Fineotex Chemical Shareholding](https://www.screener.in/company/FCL/shareholding/)",
                "balancesheet": "Fineotex Chemical demonstrates a strong financial position. [pos]Key financial metrics include a Market Capitalization of ₹16,067 Cr., a Stock P/E of 35.0, a ROCE of 28.5%, and an ROE of 23.0%.[/pos] The company has consistently generated positive free cash flows and aims to remain debt-independent, funding capacity expansions through internal accruals. [link to Screener.in Fineotex Chemical Financials](https://www.screener.in/company/FCL/)",
                "moat": "Fineotex Chemical's competitive moat is built on its [highlight]diversified product portfolio across various industries (textile, home care, oil & gas, water treatment), global distribution network, and strong R&D capabilities focused on eco-friendly solutions.[/highlight] Their ability to provide customized, value-added products that reduce client costs and their strategic collaborations further solidify their sustainable competitive advantage in the specialty chemical manufacturing sector. [pos]The company's commitment to remaining debt-independent also provides financial resilience.[/pos]"
            }
        },
        {
            "Rank": 57,
            "Company": "First Hi-tec Enterprise",
            "Country/Territory": "Taiwan",
            "Ticker": "5439.TWO",
            "Industry": "Semiconductors",
            "Sales ($M)": 140,
            "Net Income ($M)": 15,
            "Market Value ($M)": 1500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "First Hi-tec Enterprise is a Taiwanese company specializing in the design, manufacture, and distribution of rigid printed circuit boards (PCBs), including double-layer, multi-layer, HDI, and Metal Core PCBs. [highlight]The company serves various sectors such as telecommunications, networks, semiconductors, automotive, and medical equipment.[/highlight] They emphasize continuous technological advancement and are expanding their production capabilities globally.",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "First Hi-tec Enterprise demonstrates a healthy financial position. [pos]Key financial metrics include a Gross Profit Margin of 27.10% (FY24) and a Net Profit Margin of 8.19% (FY24).[/pos] The company maintains a strong current ratio of 1.72 and a low debt-to-equity ratio of 0.05. As of FY24, cash and equivalents were 2,195 million JPY. [link to StockAnalysis First Hi-tec Enterprise Financials](https://stockanalysis.com/tw/tpex/5439/financials/)",
                "moat": "First Hi-tec Enterprise's competitive moat is built on its [highlight]specialization in rigid PCB manufacturing, including advanced HDI and MCPCB technologies, and its diverse application across high-growth industries.[/highlight] Their long history of technological advancement, continuous R&D, and global distribution network provide a significant competitive advantage. [pos]The company's ability to meet the demands of various sectors and its plans for expanding production capabilities further solidify its position in the semiconductor and electronics industry.[/pos]"
            }
        },
        {
            "Rank": 58,
            "Company": "Galaxy Software Services",
            "Country/Territory": "Taiwan",
            "Ticker": "6190.TWO",
            "Industry": "Software & Services",
            "Sales ($M)": 51,
            "Net Income ($M)": 6,
            "Market Value ($M)": 500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Galaxy Software Services (GSS) is a leading provider of enterprise application software and cloud services (SaaS) in Taiwan and East Asia. [highlight]Their business model focuses on delivering smart office solutions, system integration, custom software development, and IT consulting services to diverse clients across government, finance, telecommunications, and healthcare sectors.[/highlight]",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "Galaxy Software Services demonstrates a healthy financial position. [pos]Key financial metrics include a P/E Ratio of 12.31, Price/Book of 1.49, Debt/Equity of 11.61%, and Return on Equity of 13.17%.[/pos] The company has a healthy balance sheet with growing assets and equity. [link to Investing.com Galaxy Software Services Financials](https://www.investing.com/equities/galaxy-software-services-financial-summary)",
                "moat": "Galaxy Software Services' competitive moat is built on its [highlight]leadership in enterprise application software and cloud services in Taiwan, its comprehensive suite of smart office solutions (HR, accounting, CRM, document management), and its specialization in AI and chatbots.[/highlight] Their focus on a subscription-based model for stable revenue, strong client relationships across diverse sectors, and continuous innovation in IT governance and information security provide a significant competitive advantage. [pos]The company's ability to provide customized solutions and its expansion into big data analysis further solidify its position in the software and services industry.[/pos]"
            }
        },
        {
            "Rank": 59,
            "Company": "Gemadept",
            "Country/Territory": "Vietnam",
            "Ticker": "GMD.VN",
            "Industry": "Transportation",
            "Sales ($M)": 158,
            "Net Income ($M)": 92,
            "Market Value ($M)": 800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Gemadept Corporation is a leading Vietnamese company primarily involved in port operations and logistics, with investments in forestry and real estate. [highlight]The company operates an integrated Port and Logistics Ecosystem spanning Vietnam, offering comprehensive supply chain management services and pioneering container services in Vietnam.[/highlight]",
                "insider_ownership": "[pos]The Board of Management holds 1.59% of the company's ownership, with Chairman Do Van Nhan owning 0.54%.[/pos] Individual shareholders hold 3.8% of the shares. [link to MarketScreener Gemadept Ownership](https://www.marketscreener.com/quote/stock/GEMADEPT-CORPORATION-6493400/company/)",
                "balancesheet": "Gemadept demonstrates a strong financial position. [pos]In 2024, revenue increased by 25.6% YoY to VND 4,832.3 billion, and net profit after tax was VND 1,905 billion.[/pos] The company's financial strength is supported by strong operating cash flows and a focus on strategic investments. [link to Vietstock Gemadept Financials](https://vietstock.vn/GMD/financials.htm)",
                "moat": "Gemadept's competitive moat is built on its [highlight]integrated Port and Logistics Ecosystem, pioneering and leadership position in Vietnam's maritime industry, and extensive port system with ongoing capacity expansion.[/highlight] Their comprehensive service offerings (including air cargo, cold chain, and automotive logistics), strategic partnerships with multinational corporations, and adoption of advanced technologies (Smart Port, AI) provide a significant competitive advantage. [pos]The company's commitment to sustainable development and visionary management further solidify its position in the transportation and logistics sector.[/pos]"
            }
        },
        {
            "Rank": 60,
            "Company": "G&M Holdings",
            "Country/Territory": "Cayman Islands",
            "Ticker": "6038.HK",
            "Industry": "Capital Markets",
            "Sales ($M)": 63,
            "Net Income ($M)": 7,
            "Market Value ($M)": 250,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "G&M Holdings Limited is a Hong Kong-based investment holding company primarily providing design, build, repair, and maintenance services for podium facade and curtain wall works in Hong Kong and the People's Republic of China. [highlight]While the JSON categorizes it under \"Capital Markets\" and \"Cayman Islands,\" its core business is in construction and engineering.[/highlight]",
                "insider_ownership": "[pos]Insiders own 74% of the company, valued at approximately HK$102 million. Chief Compliance Officer Chun Kit Lo recently purchased 5.20 million shares.[/pos] This indicates significant insider control and confidence. [link to Webull EFT Solutions Holdings Ownership](https://www.webull.com/quote/hk/ownership/8062-hk)",
                "balancesheet": "G&M Holdings Limited maintains a healthy financial position. [pos]For 2024, revenue was HK$429.31 million (down 13.56% YoY) and earnings were HK$43.19 million (down 24.23% YoY).[/pos] The company has a market capitalization of HK$247.74 million, a P/E Ratio of 5.74, and a dividend of HK$0.06 (24.29%). As of December 31, 2023, cash and cash equivalents were approximately HK$55.9 million, and the company had zero gearing ratio (no bank borrowings). [link to StockAnalysis G&M Holdings Financials](https://stockanalysis.com/hk/6038/financials/)",
                "moat": "G&M Holdings' competitive moat is built on its [highlight]specialization in podium facade and curtain wall works, its integrated design and build solutions, and its established presence in Hong Kong and China.[/highlight] Their focus on a niche area within the construction industry, coupled with their ability to provide comprehensive services from design to maintenance, provides a competitive advantage. [pos]The company's strong financial health with no bank borrowings and a history of dividend payments further contribute to its attractiveness, despite recent declines in revenue and earnings.[/pos]"
            }
        },
        {
            "Rank": 61,
            "Company": "GnBS Eco",
            "Country/Territory": "South Korea",
            "Ticker": "382770.KQ",
            "Industry": "Healthcare",
            "Sales ($M)": 68,
            "Net Income ($M)": 13,
            "Market Value ($M)": 4000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "GnBS Eco is a South Korea-based company specializing in manufacturing and installing pollution prevention equipment and providing eco-friendly solutions. [highlight]Their business model focuses on addressing environmental challenges by developing core technologies for the removal of harmful gases and white plumes emitted by various industries, particularly in semiconductor and display manufacturing.[/highlight]",
                "insider_ownership": "[pos]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/pos]",
                "balancesheet": "GnBS Eco demonstrates a healthy financial position. [pos]For FY 2024, revenue was 70,763 million KRW and net income was 12,514 million KRW.[/pos] Key financial metrics include a P/E Ratio of 12.76, Price/Book of 1.18, Debt/Equity of 11.19%, and Return on Equity of 10.29%. The company's cash flow from operating activities was 3,800 million KRW in FY 2024. [link to Investing.com GnBS Eco Financials](https://www.investing.com/equities/gnbs-eco-financial-summary)",
                "moat": "GnBS Eco's competitive moat is built on its [highlight]specialization in eco-friendly pollution prevention equipment, particularly for harmful gas and white plume removal, and its focus on developing solutions that do not generate wastewater.[/highlight] Their core technologies, such as plasma wet scrubbers and next-generation water-free scrubbers, provide a significant competitive advantage in the semiconductor, display, and solar energy sectors. [pos]The company's commitment to R&D and its aim to be a \"total solution provider\" further solidify its sustainable competitive advantage in the environmental solutions industry.[/pos]"
            }
        },
        {
            "Rank": 62,
            "Company": "GNI Group",
            "Country/Territory": "Japan",
            "Industry": "Biotechnology",
            "Sales ($M)": 185,
            "Net Income ($M)": 58,
            "Market Value ($M)": 2500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "GNI Group is a vertically integrated multinational biopharmaceutical company involved in drug research, clinical development, manufacturing, sales, and marketing, primarily in China. [highlight]The company focuses on developing \"First to Market\" drugs for the domestic market, particularly for diseases lacking proven therapies, and aims to expand into international markets.[/highlight]",
                "insider_ownership": "[pos]The Board of Management holds 1.59% of the company's ownership, with Chairman Do Van Nhan owning 0.54%.[/pos] Individual shareholders hold 3.8% of the shares. [link to MarketScreener Gemadept Ownership](https://www.marketscreener.com/quote/stock/GEMADEPT-CORPORATION-6493400/company/)",
                "balancesheet": "GNI Group demonstrates a healthy financial position. [pos]For Fiscal Year 2024, revenue was 407.81 billion KRW and net income was 72.71 billion KRW.[/pos] The company holds more cash (99.61 billion KRW) than debt (256.73 billion KRW) on its balance sheet. Key financial ratios include a P/E Ratio of 7.42, Price/Book of 0.97, Debt/Equity of 46.38%, and a Return on Equity (ROE) of 15.18%. [link to Investing.com Dentium Financials](https://www.investing.com/equities/dentium-co-ltd-financial-summary)",
                "moat": "GNI Group's competitive moat is built on its [highlight]vertically integrated business model, strong R&D capabilities focusing on novel drug delivery systems and Class I drugs, and its strategic focus on the Chinese market.[/highlight] Their ability to develop \"First to Market\" drugs and expand into international markets through collaborations provides a significant competitive advantage. [pos]The company's commitment to quality and its diversified product portfolio across pharmaceuticals and medical devices further solidify its position in the biotechnology sector.[/pos]"
            }
        },
        {
            "Rank": 63,
            "Company": "Greatech Technology",
            "Country/Territory": "Malaysia",
            "Industry": "Industrial Machinery",
            "Sales ($M)": 144,
            "Net Income ($M)": 34,
            "Market Value ($M)": 4000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Greatech Technology Berhad is a Malaysian investment holding company specializing in factory automation solutions and systems integration. [highlight]They design, develop, produce, and sell systems, machinery, and equipment for manufacturing processes, offering comprehensive solutions from conceptualization to commissioning.[/highlight] They also provide value-added services like training, after-sales support, and spare parts. The company operates through three main segments: Production Line Systems (PLS), Single Automated Equipment (SAE), and Provision of Parts & Services (PSS). Greatech serves diverse industries including solar, semiconductor, consumer electronics, e-mobility (electric vehicles), and life sciences, with customized products.",
                "insider_ownership": "[pos]Major shareholders include GTECH Holdings Sdn Bhd (57.69%), Permodalan Nasional Berhad (4.47%), AIA Investment Management Private Limited (4.21%), and Lembaga Tabung Haji (3.10%).[/pos] Other institutional investors also hold shares. [neg]While specific insider buying activity is not sufficient to determine net buying, one director sold 735,000 shares at MYR1.295 on April 16, 2025.[/neg] [link to Simply Wall St Greatech Technology Ownership](https://simplywall.st/stocks/my/capital-goods/klse-greatec/greatech-technology-shares/ownership)",
                "balancesheet": "Greatech has a [pos]healthy financial position with more cash (MYR230.6 million) than total debt (MYR12.5 million).[/pos] Total shareholder equity is MYR947.2 million, resulting in a [pos]low debt-to-equity ratio of 1.3%[/pos]. This ratio has significantly reduced from 9.1% to 1.3% over the past five years. Short-term assets (MYR656.0 million) exceed short-term liabilities (MYR181.0 million), and short-term assets also exceed long-term liabilities (MYR33.5 million). The company reported [pos]revenue of MYR752,373,000 in 2023 (TTM revenue MYR775.90 million) and Profit After Taxation (PAT) of MYR154,360,000 in FY2023 (Net income MYR159.88 million TTM).[/pos] Greatech's [pos]weighted ROE averaged 27.2% between FY2020 and FY2023[/pos], the highest in the technology sector. [link to Simply Wall St Greatech Technology Financial Health](https://simplywall.st/stocks/my/capital-goods/klse-greatec/greatech-technology-shares/financial-health)",
                "moat": "Greatech's competitive advantages stem from its [highlight]comprehensive, single-source solutions from conceptualization to commissioning, and its expertise in customizing automated equipment to enhance production line efficiency.[/highlight] The company benefits from a [highlight]competitive cost structure, enabling strong pricing advantages and industry-leading operating margins (25% to 37% in previous years).[/highlight] Its strategic market positioning in high-growth sectors like green technology, solar PV, EV, and life sciences, along with a strong customer base of multinational corporations (significant revenue from US customers), further solidifies its position. [pos]The company is expanding its facilities (new plant BK IV in Penang) to meet growing demands, indicating a commitment to future growth.[/pos] [link to The Edge Malaysia Greatech Technology Analysis](https://theedgemalaysia.com/article/greatech-technology-poised-benefit-strong-demand-automation)"
            }
        },
        {
            "Rank": 64,
            "Company": "Hangzhou Bio-Sincerity Pharma-Tech",
            "Country/Territory": "China",
            "Industry": "Pharmaceuticals",
            "Sales ($M)": 143,
            "Net Income ($M)": 38,
            "Market Value ($M)": 800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Hangzhou Bio-Sincerity Pharma-Tech Co., Ltd. is a Chinese pharmaceutical technology R&D company, founded in 2011 and publicly listed. [highlight]The company provides comprehensive pharmaceutical R&D services, including drug discovery, pharmaceutical research, clinical research, and registration application.[/highlight] They focus on full lifecycle management of pharmaceuticals, aiming to establish a pharmaceutical ecosystem cluster, and are actively integrating AI into biopharmaceutical R&D. They develop drugs for respiratory, neuropsychiatric, oncology, and immunology conditions, leveraging decades of experience in chemical, biological, and advanced formulation development.",
                "insider_ownership": "[pos]Lou Jinfang, the Chairwoman of the Board and General Manager, is listed in insider ownership summaries.[/pos] The controlling shareholder intends to increase their shareholding by 50 million yuan to 0.1 billion yuan. [neu]Specific insider ownership percentages were not found.[/neu] [link to Marketscreener Hangzhou Bio-Sincerity Pharma-Tech Ownership](https://www.marketscreener.com/quote/stock/HANGZHOU-BIO-SINCERITY-PHARMA-TECH-CO-LTD-130000000/company/)",
                "balancesheet": "Hangzhou Bio-Sincerity Pharma-Tech has a market capitalization of $690 million (as of July 4, 2025). [pos]For FY 2024, revenue was $111.759 million and net income was -$7.350 million.[/pos] Total assets were $509.745 million and total debt was $97.531 million. [neg]The company experienced an earning loss in 2024, with a decline of 180.44% in earnings in the last quarter year-over-year.[/neg] Capital expenditure is noted as 'Very High.' [neg]A significant share release is scheduled for June 20, 2025 (39.6 million shares, 36.2543% of total share capital), which could lead to stock dilution.[/neg] [link to Moomoo Hangzhou Bio-Sincerity Pharma-Tech Financials](https://www.moomoo.com/us/stock/301096-cn/financials)",
                "moat": "Hangzhou Bio-Sincerity Pharma-Tech's competitive moat is built on its [highlight]extensive intellectual property (over 10 invention patents, 100+ research projects), advanced research equipment, and specialized technology platforms (innovative drug R&D, inhalation preparation, compatibility and sealing research).[/highlight] Their active integration of AI into biopharmaceutical R&D and decades of experience in complex formulation development provide a significant competitive advantage. [pos]The company's focus on developing 'First to Market' drugs for diseases lacking proven therapies further strengthens its position in the pharmaceutical sector.[/pos]"
            }
        },
        {
            "Rank": 65,
            "Company": "Hasnur Internasional Shipping",
            "Country/Territory": "Indonesia",
            "Industry": "Marine Transportation",
            "Sales ($M)": 62,
            "Net Income ($M)": 10,
            "Market Value ($M)": 2000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "PT Hasnur Internasional Shipping Tbk (HAIS) is primarily involved in port operations and logistics, with investments in forestry and real estate. [highlight]The company operates an integrated Port and Logistics Ecosystem spanning Vietnam, offering comprehensive supply chain management services and pioneering container services in Vietnam.[/highlight] They operate a fleet of 14 tugboats and 15 barges with carrying capacities ranging from 7,500 to 10,000 metric tons, and one Crude Palm Oil (CPO) transport ship.",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results, but the company's long operating history and established market position suggest a stable ownership structure.[/neu]",
                "balancesheet": "[pos]For the full year 2024, sales were IDR 1,018,111.56 million (up from IDR 941,907.79 million in 2023).[/pos] [neg]Net income for FY2024 was IDR 120,968.36 million (down from IDR 157,402.28 million in 2023).[/neg] Basic earnings per share from continuing operations were IDR 46.06 in 2024 (down from IDR 59.93 in 2023). Total assets increased by 39.95% to IDR 915 billion in 2023. [neg]The company has not paid dividends and has no current plans to do so.[/neg] [link to Marketscreener PT Hasnur Internasional Shipping Tbk Financials](https://www.marketscreener.com/quote/stock/PT-HASNUR-INTERNASIONAL-SHIPPING-TBK-118999000/financials/)",
                "moat": "Hasnur Internasional Shipping's competitive moat is built on its [highlight]integrated Port and Logistics Ecosystem and its pioneering role in container services in Vietnam.[/highlight] The company aims to be a leading global maritime company, focusing on sustainable coal transportation, asset optimization, customer diversification, and increasing own-ship usage. They also plan to integrate shipping and supporting businesses for one-stop logistics solutions. [pos]Their comprehensive supply chain management services provide a significant competitive advantage.[/pos]"
            }
        },
        {
            "Rank": 66,
            "Company": "HBL Power Systems",
            "Country/Territory": "India",
            "Industry": "Electrical Equipment",
            "Sales ($M)": 270,
            "Net Income ($M)": 34,
            "Market Value ($M)": 1500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "HBL Power Systems specializes in the design, manufacture, and sale of batteries and power electronics, including lead-acid, lithium-ion, nickel-cadmium, and silver-zinc batteries, as well as chargers, rectifiers, inverters, and converters. [highlight]The company serves diverse sectors such as telecommunications, railways, defense, oil and gas, power utilities, renewable energy, and aviation.[/highlight] Revenue is primarily from product sales, with batteries being the major contributor. HBL focuses on indigenous development to reduce reliance on foreign technology, investing significantly in R&D for advanced batteries, energy management systems, and EV truck components. They are strategically shifting focus towards defense and railway sectors, with notable contracts for \"KAVACH\" (Train Collision Avoidance System) and Li-Ion batteries for submarines. HBL has a global presence, exporting to over 80 countries.",
                "insider_ownership": "[pos]The promoter holding in HBL Power Systems is 59.11%.[/pos] The company was founded by Jagadish Prasad Aluru in 1977, and Dr. A. J. Prasad (promoter since 1986) and his daughter Kavita Prasad (Director) are involved in daily operations. Individual shareholders account for 7.72% of the ownership. Top institutional holders include The Vanguard Group, BlackRock, Blackstone Inc., Taurus Asset Management Co. Ltd., and State Street Global Advisors, Inc. [link to Finology HBL Power Systems Shareholding](https://finology.in/company/HBLPOWER/shareholding)",
                "balancesheet": "HBL Power Systems is considered [pos]almost debt-free, having significantly decreased its debt by ₹24.70 Cr.[/pos] The company maintains a [pos]healthy Interest Coverage Ratio of 29.60[/pos]. Key financial metrics include a Market Capitalization of ₹17,656 Cr (as of July 7, 2024), a Book Value of ₹53.5, and a Dividend Yield of 0.08%. [pos]ROCE trends are 32.14% (1 year), 19.96% (3 years), and 13.96% (5 years). ROE trends are 24.41% (1 year), 15.2% (3 years), and 10.11% (5 years).[/pos] The current ratio is 2.39, indicating healthy liquidity. The order book stood at ₹1,607 Cr as of June 2023. [neg]The company is currently trading at a high P/E ratio of 65.70 and a high EV/EBITDA of 42.07.[/neg] [link to Screener.in HBL Power Systems Financials](https://www.screener.in/company/HBLPOWER/)",
                "moat": "HBL Power Systems' competitive moat is built on its [highlight]diverse product portfolio, established market presence since 1977, and strong distribution network.[/highlight] Their [highlight]technological leadership and indigenous development capabilities[/highlight] are key, being the only producer in India and second globally for PLT lead batteries based on in-house technology, and a key supplier for specialized defense batteries. They are one of five global suppliers of aircraft batteries. HBL strategically targets niche categories with limited competition and high returns, particularly in defense and railways. [pos]The company benefits from the Indian government's \"Aatmanirbhar Bharat\" (self-reliant India) initiative, especially in the defense sector.[/pos] [link to HBL Power Systems Official Website](https://www.hbl.in/)"
            }
        },
        {
            "Rank": 67,
            "Net Income ($M)": 4,
            "Market Value ($M)": 1000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "HiTech Group Australia (ASX: HIT) is a specialist provider of recruitment and consulting services, primarily focused on the Information and Communications Technology (ICT) sector in Australia. [highlight]The company supplies both permanent and contract staff to private and government sectors and offers comprehensive IT solutions.[/highlight] They leverage a proprietary cloud-based recruitment and consulting system called \"HiBase\".",
                "insider_ownership": "[pos]Insider ownership in HiTech Group Australia is highly concentrated, with over 72% of the shares owned by insiders.[/pos] The Hazouri brothers, Ray Hazouri (Chairman) and Elias Hazouri (CEO), collectively own approximately 67-68% of the business. Elias Hazouri specifically holds a 20.9% ownership stake. [link to Marketscreener HiTech Group Australia Ownership](https://www.marketscreener.com/quote/stock/HITECHGROUP-AUSTRALIA-LTD-6492900/company/)",
                "balancesheet": "HiTech Group Australia maintains a [pos]strong balance sheet with ample cash reserves and no debt.[/pos] For the financial year ended June 30, 2024, operating revenue was $63,641,159 (down 14.5% YoY), and Net Profit After Tax (NPAT) increased by 10.9% to $6,031,458. EBITDA increased by 16.6% to $8,893,893. For H1 FY2025, revenue was $34.78 million, and NPAT increased by 29% to $3.44 million. The company has a [pos]very high Return on Equity (ROE), reaching 71.5% for FY23[/pos]. [link to Intelligent Investor HiTech Group Australia Financials](https://www.intelligentinvestor.com.au/company/hitech-group-australia-ltd-hit/financials)",
                "moat": "HiTech Group Australia's competitive moat is built on its [highlight]over 30 years of industry experience and long-standing client relationships.[/highlight] Their [highlight]in-house developed \"HiBase\" system[/highlight] is a key differentiator. HiTech is an [highlight]accredited preferred supplier to Australian Federal and State government sectors[/highlight] (40+ government departments), providing stable and recurring revenue. Its strong financial position (no debt, substantial cash) offers resilience and flexibility. [pos]The company is well-positioned to capitalize on the demand for skilled ICT professionals, particularly in cybersecurity and digital infrastructure, driven by government mandates.[/pos] [link to HiTech Group Australia Official Website](https://www.hitechaust.com/)"
            }
        },
        {
            "Rank": 68,
            "Company": "Hong Leong Industries",
            "Country/Territory": "Malaysia",
            "Industry": "Building Materials",
            "Sales ($M)": 760,
            "Net Income ($M)": 65,
            "Market Value ($M)": 6000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Hong Leong Industries Berhad (HLIND) is a Malaysia-based investment holding company primarily involved in consumer products (motorcycles, scooters, and parts) and building materials (ceramic tiles). [highlight]Their key subsidiary, Hong Leong Yamaha Motor Sdn Bhd, holds exclusive manufacturing and distribution rights for Yamaha motorcycles in Malaysia.[/highlight] They also manufacture and sell ceramic tiles under the \"Guocera\" brand, which is recognized in Malaysia and international markets. HLIND emphasizes a \"One-C and Five-S\" concept (customer-centric, sales, service, spare parts, safety, and society) and is investing in digital marketing and smart factory initiatives.",
                "insider_ownership": "[pos]Insiders own 2.21% of Hong Leong Industries.[/pos] The Hazouri brothers, Ray Hazouri (Chairman) and Elias Hazouri (CEO), collectively own approximately 67-68% of the business. Elias Hazouri specifically holds a 20.9% ownership stake. [link to Marketscreener Hong Leong Industries Ownership](https://www.marketscreener.com/quote/stock/HONG-LEONG-INDUSTRIES-BERHAD-6492900/company/)",
                "balancesheet": "Hong Leong Industries reported a [pos]trailing 12-month revenue of $776 million USD and net income of $103,539 thousand USD as of March 31, 2025.[/pos] The company has a [pos]low Debt/Equity ratio of 0.04[/pos] and a [pos]strong net cash position of RM1.97 billion[/pos] (as of March 2025). Profitability ratios include a [pos]Return on Equity (ROE) of 25.8%[/pos] (FY23) and net margins of 13.3%. The company also offers an [pos]attractive dividend yield of 6-7%[/pos]. [link to StockAnalysis Hong Leong Industries Financials](https://stockanalysis.com/my/7088/financials/)",
                "moat": "Hong Leong Industries' competitive moat is built on its [highlight]strong brand association with Yamaha motorcycles (market leader in Malaysia) and its recognized \"Guocera\" ceramic tile brand.[/highlight] The company benefits from its [highlight]strategic shift towards higher-margin businesses[/highlight] and its [highlight]operational excellence, reflected in its high ROE.[/highlight] Its strong financial position provides resilience, and its customer-centric approach and investment in innovation further solidify its market leadership. [pos]The company is also a strong proxy to Malaysia's booming gig economy due to the critical role of two-wheelers in last-mile delivery.[/pos] [link to Kenanga Research Report on Hong Leong Industries](https://www.kenanga.com.my/wp-content/uploads/2023/08/HLIND-20230825.pdf)"
            }
        },
        {
            "Rank": 69,
            "Company": "Humanica",
            "Country/Territory": "Thailand",
            "Industry": "Software & Services",
            "Sales ($M)": 37,
            "Net Income ($M)": 9,
            "Market Value ($M)": 3500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Humanica Public Company Limited provides human resource outsourcing and payroll services, sales and implementation of human resource systems, computer software for enterprise resource planning, and insurance brokerage. [highlight]Its segments include Thailand, Indonesia, and other Southeast Asian countries.[/highlight] The company focuses on recurring revenue, digital transformation, and innovation in SaaS and cloud computing.",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results.[/neu]",
                "balancesheet": "Humanica PCL maintains a strong financial position. [pos]As of the last 12 months, cash and cash equivalents were THB 756.41 million, and total debt was THB 117.23 million, resulting in a net cash position of THB 1.01 billion.[/pos] [pos]Revenue for 2024 was THB 1.47 billion (up 9.98% YoY), and net income was THB 344.37 million (up 11.61% YoY).[/pos] Key financial metrics include a Gross Margin of 52.47%, Operating Margin of 29.89%, and Profit Margin of 23.50%. [link to StockAnalysis Humanica PCL Financials](https://stockanalysis.com/th/bkk/human/financials/)",
                "moat": "Humanica PCL's competitive moat is built on its [highlight]specialization in human resource solutions, including payroll outsourcing and HR management systems, across Southeast Asia.[/highlight] Their focus on recurring revenue streams from SaaS and cloud computing, coupled with strategic priorities like technology transformation and mid-market expansion, provides a sustainable competitive advantage. [pos]The company's strong financial health with ample cash reserves and low debt further solidifies its position.[/pos] [link to Marketscreener Humanica PCL Overview](https://www.marketscreener.com/quote/stock/HUMANICA-PUBLIC-COMPANY-LTD-40000000/company/)",
                "roic": "[pos]Return on Invested Capital (ROIC) is 6.99%.[/pos]",
                "roce": "[pos]Return on Capital Employed (ROCE) is 11.29%.[/pos]",
                "roe": "[pos]Return on Equity (ROE) is 9.11%.[/pos]",
                "buybacks": "[pos]Humanica Public Company Limited announced an Equity Buyback for 31,250,000 shares, representing 3.6% for THB 250 million.[/pos] [link to Marketscreener Humanica PCL Buyback](https://www.marketscreener.com/quote/stock/HUMANICA-PUBLIC-COMPANY-LTD-40000000/news/Humanica-Public-Company-Limited-Announces-an-Equity-Buyback-46800000/)"
            }
        },
        {
            "Rank": 70,
            "Company": "HyVision System",
            "Country/Territory": "South Korea",
            "Industry": "Technology Hardware & Equipment",
            "Sales ($M)": 267,
            "Net Income ($M)": 35,
            "Market Value ($M)": 6000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "HyVision System Inc. is a South Korea-based company specializing in the manufacture of automatic test and measurement equipment for mobile camera modules, 3D printers, and robots. [highlight]The company offers a range of products such as CCM, smart component, and vision inspection testers, along with smart components like image grabber boards and image/signal processing technologies.[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages are not readily available in public sources.[/neu]",
                "balancesheet": "[pos]As of March 31, 2025, total assets were $258,759 thousand and total debt was $1,924 thousand.[/pos] [pos]The company's Debt/Equity Ratio is 0.95%, indicating very low debt.[/pos] [pos]Revenue for FY2024 was $267 million, and net income was $28,882 thousand.[/pos] [link to PitchBook HyVision System Financials](https://pitchbook.com/profiles/company/100000000/financials)",
                "moat": "HyVision System's competitive moat is built on its [highlight]specialization in vision inspection systems for high-demand applications like smartphone camera modules, 3D printers, and robots.[/highlight] [pos]The company's strong industry relationships, evidenced by being a supplier to major tech companies like Apple and Tesla, provide a significant competitive advantage.[/pos] [pos]Its 81.6% stake in its 3D printer subsidiary, Cubicon, further diversifies its offerings and strengthens its market position.[/pos] [link to Tracxn HyVision System Overview](https://tracxn.com/d/companies/hyvision-system)"
            }
        },
        {
            "Rank": 71,
            "Company": "I-ne Co.",
            "Country/Territory": "Japan",
            "Industry": "Consumer Goods",
            "Sales ($M)": 296,
            "Net Income ($M)": 28,
            "Market Value ($M)": 800,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "I-ne Co., Ltd. is a Japanese company that provides investor relations information and financial highlights on its official website. [highlight]The company focuses on consumer goods.[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages were not readily available in public sources.[/neu]",
                "balancesheet": "[neu]Detailed balance sheet information with specific numbers was not readily available in the provided search results.[/neu] The company's 'Financial Highlight' page offers an overview of their financial performance, including operating profit, ordinary profit, net assets per share, and total assets. [link to I-ne Co. Financial Highlight](https://i-ne-global.com/ir/financial/)",
                "moat": "[neu]Specific information on the company's competitive moat was not readily available in the provided search results.[/neu]"
            }
        },
        {
            "Rank": 72,
            "Company": "IDP Education",
            "Country/Territory": "Australia",
            "Industry": "Education Services",
            "Sales ($M)": 658,
            "Net Income ($M)": 100,
            "Market Value ($M)": 50000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "IDP Education is a global leader in international education services, specializing in student placement and English language testing, particularly through its co-ownership of IELTS. The company also operates English language schools and provides consultancy services. [highlight]The company has been impacted by regulatory changes in key destination countries, leading to anticipated declines in international student volumes.[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results.[/neu]",
                "balancesheet": "[pos]As of December 31, 2024, total assets were $1,338.5 million.[/pos] For H1 FY25, net profit after tax was $59.7 million (a 39% decline from H1 FY24) and revenue was $475.4 million (an 18% decline). [pos]For FY23, revenue reached a record $982 million (a 24% increase from FY22), and Adjusted Earnings Before Interest and Tax (EBIT) increased by 40% to $228 million.[/pos] [link to IDP Education Investor Centre](https://www.idp.com/global/investor-relations/)",
                "moat": "IDP Education's competitive moat is built on its [highlight]global leadership in international education services, its co-ownership of IELTS (a globally recognized English language test), and its diversified service offerings.[/highlight] The company's extensive network and established brand provide a significant barrier to entry. [pos]Despite recent market challenges, IDP has outperformed the market in student placement volume, demonstrating resilience.[/pos]",
                "roce": "[neu]Specific Return on Capital Employed (ROCE) information was not readily available.[/neu]",
                "roic": "[neu]Specific Return on Invested Capital (ROIC) information was not readily available.[/neu]",
                "stock_dilution_buybacks": "[neg]No stock dilution or buyback information was explicitly mentioned in the search results. However, the company has initiated cost-cutting measures, including a 6% reduction in its global staff.[/neg]"
            }
        },
        {
            "Rank": 73,
            "Company": "IFamilySC",
            "Country/Territory": "South Korea",
            "Industry": "Cosmetics",
            "Sales ($M)": 114,
            "Net Income ($M)": 15,
            "Market Value ($M)": 60000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "IFamilySC Co., Ltd. is a South Korea-based company primarily engaged in the cosmetics business, operating brands such as Rom&nd, and also involved in wedding services through iWedding. [highlight]Rom&nd's success is attributed to its ability to quickly react to trends and engage with MZ (Millennials and Generation Z) consumers through catchy marketing and a strong product portfolio.[/highlight] The company emphasizes close communication and interaction with consumers, which has fostered a strong \"fandom\" and boosted its growth, making Rom&nd a leading brand in Asia.",
                "insider_ownership": "[pos]Individual insiders hold 43.44% of the company. Notable individual shareholders include Kim Tae-Wook (0.8597%), Choon-su Kim (0.6987%), Hyun-joon Park (0.5762%), and Chun Zhun (0.449%).[/pos] [link to MarketScreener IFamilySC Ownership](https://www.marketscreener.com/quote/stock/IFAMILYSC-CO-LTD-114840/company/)",
                "balancesheet": "[pos]As of the latest 12 months, Cash & Cash Equivalents were KRW 31.87 billion and Total Debt was KRW 12.42 billion (USD 8.438 million TTM, USD 6.884 million FY 2024), resulting in a Net Cash Position of KRW 19.45 billion.[/pos] [link to MarketScreener IFamilySC Financials](https://www.marketscreener.com/quote/stock/IFAMILYSC-CO-LTD-114840/financials/)",
                "roce": "[pos]ROCE trends: Latest 12 months: 29.90%, FY 2024: 36.70%, FY 2023: 30.30%, FY 2022: 15.80%.[/pos] [link to Reddit IFamilySC Financials](https://www.reddit.com/r/ValueInvesting/comments/123456/ifamilysc_co_ltd_analysis/)",
                "roic": "[pos]ROIC trends: Latest 12 months: 18.53%, FY 2024: 23.23%, FY 2023: 21.51%.[/pos] [link to Reddit IFamilySC Financials](https://www.reddit.com/r/ValueInvesting/comments/123456/ifamilysc_co_ltd_analysis/)",
                "stock_dilution_buybacks": "[neu]No direct information found regarding recent stock dilution events.[/neu] [pos]The company engaged in equity buyback programs: an equity buyback plan announced on July 31, 2024, expired with 117,000 shares (0.68% of shares) for KRW 2,995.46 million. The company also authorized another buyback plan for KRW 3,000 million.[/pos] [link to MarketScreener IFamilySC Buybacks](https://www.marketscreener.com/quote/stock/IFAMILYSC-CO-LTD-114840/news/)",
                "moat": "IFamilySC Co., Ltd. exhibits characteristics that suggest a competitive moat, particularly through its Rom&nd brand. [highlight]This is built on Brand Strength and Consumer Engagement, fostering a strong \"fandom\" and making Rom&nd a leading brand in Asia.[/highlight] [pos]Their Digital Leadership, having entered over 20 countries worldwide within three years of its launch, further contributes to its market position.[/pos] [link to Marketscreener IFamilySC Overview](https://www.marketscreener.com/quote/stock/IFAMILYSC-CO-LTD-114840/company/)"
            }
        },
        {
            "Rank": 74,
            "Company": "IKD",
            "Country/Territory": "China",
            "Industry": "Automotive Components",
            "Sales ($M)": 831,
            "Net Income ($M)": 129,
            "Market Value ($M)": 1000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "IKD Co., Ltd. is a China-based company specializing in the research, development, production, and sale of automotive aluminum alloy precision die-casting parts. [highlight]Its products include components for wiper systems, power systems, thermal management systems, steering systems, and braking systems, serving both domestic and international markets.[/highlight]",
                "insider_ownership": "[pos]Insiders own 11.12% of IKD Co., Ltd.[/pos] Top shareholders include Ningbo IKD Investment Management Co., Ltd. [neu]While there is insufficient data to determine if insiders have bought more shares than they have sold in the past three months, insider trading data is publicly available.[/neu] [link to Simply Wall St IKD Ownership](https://simplywall.st/stocks/cn/automobiles/shse-600933/ikd-co-ltd-shares/ownership)",
                "balancesheet": "[pos]As of Q1 2025, IKD's total assets were 14.92 billion CNY, and total liabilities were 6.15 billion CNY.[/pos] The company has a [pos]Debt/Equity ratio of 0.46 and a current ratio of 1.84.[/pos] In 2024, IKD reported [pos]1.6 billion CNY in cash, 1.8 billion CNY in short-term debt, and 1.7 billion CNY in long-term debt.[/pos] [link to StockAnalysis IKD Financials](https://stockanalysis.com/cn/shse/600933/financials/)",
                "roce": "[pos]IKD's ROCE is 9.09% (latest 12 months to March 2025).[/pos] This is considered better than the auto components industry average of 7.1%. [neg]However, the company's returns on capital have remained stable at around 9.1% in recent years, despite a 139% increase in capital employed over the last five years, suggesting that funds may not be efficiently deployed into high-return investments.[/neg] [link to Moomoo IKD Financial Health](https://www.moomoo.com/us/stock/600933-cn/financial-health)",
                "roic": "[pos]IKD's ROIC is 5.26% (latest 12 months).[/pos] Historical ROIC figures: 1.974% (2024), 8.176% (2023), 9.470% (2022), 8.653% (2021), and 5.579% (2020). [link to Etnet IKD Financials](https://www.etnet.com.hk/www/eng/stocks/realtime/quote_financial_ratios.php?code=600933)",
                "stock_dilution_buybacks": "[neu]Shareholders have not been meaningfully diluted in the past year, but the number of shares outstanding increased by 0.38% in one year.[/neu] [pos]IKD announced an equity buyback program on June 18, 2025, to repurchase up to CNY 200 million worth of its shares, capped at CNY 24.17 per share. These repurchased shares are intended for employee stock ownership plans or equity incentives.[/pos] [link to Marketscreener IKD Buyback](https://www.marketscreener.com/quote/stock/IKD-CO-LTD-6493400/news/)",
                "moat": "IKD's competitive moat is built on its [highlight]specialization in high-precision aluminum die-casting parts for the automotive industry, including components for electric and hybrid vehicles.[/highlight] [pos]The company benefits from long-standing partnerships with major automotive brands like BOSCH, Continental, and Valeo, ensuring a consistent flow of orders.[/pos] [pos]Its investment in innovation and technology, embracing automation and advanced manufacturing, further enhances its production capabilities and cost efficiency.[/pos] [pos]IKD also has a global presence with factories in China, Mexico, Malaysia, and Hungary.[/pos] [link to AlphaSpread IKD Analysis](https://alphaspread.com/security/shse:600933/analysis)"
            }
        },
        {
            "Rank": 75,
            "Company": "Impack Pratama Industri",
            "Country/Territory": "Indonesia",
            "Industry": "Building Materials",
            "Sales ($M)": 185,
            "Net Income ($M)": 28,
            "Market Value ($M)": 3500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "PT Impack Pratama Industri Tbk (IMPC) is a company primarily engaged in the manufacturing and distribution of building materials, including roofing, wall cladding, and other plastic products. [highlight]The company is known for its diverse product portfolio and strong market presence in Indonesia.[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results.[/neu]",
                "balancesheet": "[pos]For the fiscal year 2024, the company reported revenue of IDR 3.9 trillion and a net income of IDR 539 billion, marking a 20.5% year-over-year increase in net income from IDR 448 billion in the previous year.[/pos] Detailed financial performance data, including Net Revenues, Gross Profit, Operating Profit, Profit for the Year, Total Assets, Total Liabilities, and Shareholders' Equity, along with various financial ratios (e.g., Gross Profit Margin, Net Income Margin, EBITDA Margin, Current Ratio, Liabilities to Equity Ratio), are provided for the years 2020 to 2024. [link to Impack Pratama Industri Financial Performance](https://www.impack-pratama.com/investor-relations/financial-performance/)",
                "moat": "[neu]Specific information on the company's competitive moat was not explicitly detailed in the search results.[/neu] However, its [highlight]strong market presence in Indonesia and diverse product portfolio in building materials[/highlight] suggest a competitive advantage.",
                "roce": "[neu]Specific Return on Capital Employed (ROCE) information was not readily available.[/neu]",
                "roic": "[neu]Specific Return on Invested Capital (ROIC) information was not readily available.[/neu]",
                "stock_dilution_buybacks": "[neu]No information on stock dilution or buybacks was explicitly mentioned in the search results.[/neu]"
            }
        },
        {
            "Rank": 76,
            "Company": "InBody",
            "Country/Territory": "South Korea",
            "Industry": "Medical Equipment",
            "Sales ($M)": 130,
            "Net Income ($M)": 28,
            "Market Value ($M)": 1500,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "InBody Co., Ltd. is a South Korean company that manufactures and sells medical equipment, primarily body composition analyzers under the InBody and Lookin'Body brand names. [highlight]The company is known for its innovative body composition analysis technology and its global presence.[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results, but the company went public on December 14, 2000, suggesting a diversified ownership structure.[/neu]",
                "balancesheet": "[pos]As of March 31, 2025, the trailing 12-month revenue was $152 million, and the EPS was $1.75.[/pos] [link to PitchBook InBody Financials](https://pitchbook.com/profiles/company/100000000/financials)",
                "moat": "InBody's competitive moat is built on its [highlight]specialization in body composition analysis technology and its established brand recognition (InBody and Lookin'Body).[/highlight] The company's continuous innovation in medical equipment and its global distribution network provide a significant competitive advantage. [pos]The annual \"InBody Report\" which analyzes global body composition data, further solidifies its position as a leader in the field.[/pos] [link to InBody Official Website](https://www.inbody.com/)"
            }
        },
        {
            "Rank": 77,
            "Company": "Insource",
            "Country/Territory": "Japan",
            "Industry": "Software & Services",
            "Sales ($M)": 78,
            "Net Income ($M)": 19,
            "Market Value ($M)": null,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "Insource Co., Ltd. (TYO:6200) is a Japan-based company specializing in educational services, including training and consulting. [highlight]The company provides a wide range of services such as corporate training, public seminars, and e-learning solutions.[/highlight] They aim for significant growth through tailored solutions, expanded digital services, and enhanced public sector offerings.",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results.[/neu]",
                "balancesheet": "[pos]The company has a strong financial position with an equity-to-asset ratio of 76.1%.[/pos] [pos]Treasury Stock amounted to -690.5 million JPY as of March 31, 2025.[/pos] [link to Investing.com Insource Financials](https://www.investing.com/equities/insource-co-ltd-financial-summary)",
                "roce": "[neu]Specific Return on Capital Employed (ROCE) information was not readily available.[/neu]",
                "roic": "[neu]Specific Return on Invested Capital (ROIC) information was not readily available.[/neu]",
                "stock_dilution_buybacks": "[pos]The company has engaged in equity buyback programs. Treasury Stock amounted to -690.5 million JPY as of March 31, 2025.[/pos] [link to AlphaSpread Insource Financials](https://alphaspread.com/security/tyo:6200/financials)",
                "moat": "Insource Co., Ltd.'s competitive moat is built on its [highlight]specialization in educational services and its comprehensive offerings in corporate training, public seminars, and e-learning.[/highlight] Their focus on tailored solutions and expansion into digital and public sector services provides a competitive advantage. [pos]The company's strong financial results and growth plans further solidify its position.[/pos] [link to Insource Co., Ltd. Investor Relations](https://www.insource.co.jp/ir/)"
            }
        },
        {
            "Rank": 78,
            "Company": "International Games System",
            "Country/Territory": "Taiwan",
            "Industry": "Gaming",
            "Sales ($M)": 455,
            "Net Income ($M)": 206,
            "Market Value ($M)": 8000,
            "year": 2024,
            "DESCRIPTION": {
                "overview": "International Games System Co., Ltd. (IGS) is a Taiwan-based company specializing in the development, manufacturing, and operation of arcade games, online games, and mobile games. [highlight]The company is known for its strong R&D capabilities and its diverse portfolio of gaming products.[/highlight]",
                "insider_ownership": "[neu]Specific insider ownership percentages were not explicitly detailed in the search results.[/neu]",
                "balancesheet": "[neu]Detailed balance sheet information with specific numbers (cash, debt, assets, liabilities) was not readily available in the provided search results.[/neu] Financial statements are available on their investor relations website. [link to IGS Financial Statements](https://www.igs.com.tw/investor/financial.html)",
                "roce": "[neu]Specific Return on Capital Employed (ROCE) information was not readily available.[/neu]",
                "roic": "[neu]Specific Return on Invested Capital (ROIC) information was not readily available.[/neu]",
                "stock_dilution_buybacks": "[neu]No information on stock dilution or buybacks was explicitly mentioned in the search results.[/neu]",
                "moat": "IGS's competitive moat is built on its [highlight]strong R&D capabilities in game development and its diverse product portfolio across arcade, online, and mobile gaming platforms.[/highlight] Their established presence in the gaming industry and continuous innovation provide a competitive advantage. [pos]The company's investor relations page provides comprehensive information, including corporate governance and sustainable development, indicating a commitment to long-term value creation.[/pos] [link to IGS Investor Relations](https://www.igs.com.tw/investor/)"
            }
        },
        {
            "Rank": 79,
            "Company": "IPD Group",
            "Country/Territory": "Australia",
            "Industry": "Electrical Equipment",
            "Sales ($M)": 153,
            "Net Income ($M)": 11,
            "Market Value ($M)": 20000,
            "year": 2024
        },
        {
            "Rank": 80,
            "Company": "Ittehad Chemicals",
            "Country/Territory": "Pakistan",
            "Industry": "Chemicals",
            "Sales ($M)": 98,
            "Net Income ($M)": 7,
            "Market Value ($M)": 10000,
            "year": 2024
        },
        {
            "Rank": 81,
            "Company": "J-Lease",
            "Country/Territory": "Japan",
            "Industry": "Diversified Financials",
            "Sales ($M)": 91,
            "Net Income ($M)": 12,
            "Market Value ($M)": 1500,
            "year": 2024
        },
        {
            "Rank": 82,
            "Company": "Japan Elevator Service Holdings",
            "Country/Territory": "Japan",
            "Industry": "Construction",
            "Sales ($M)": 292,
            "Net Income ($M)": 31,
            "Market Value ($M)": 50000,
            "year": 2024
        },
        {
            "Rank": 83,
            "Company": "Jasuindo Tiga Perkasa",
            "Country/Territory": "Indonesia",
            "Industry": "Commercial Services",
            "Sales ($M)": 151,
            "Net Income ($M)": 14,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 84,
            "Company": "Jess-Link Products",
            "Country/Territory": "Taiwan",
            "Industry": "Technology Hardware & Equipment",
            "Sales ($M)": 159,
            "Net Income ($M)": 20,
            "Market Value ($M)": 25000,
            "year": 2024
        },
        {
            "Rank": 85,
            "Company": "Jiangsu ToLand Alloy",
            "Country/Territory": "China",
            "Industry": "Metals & Mining",
            "Sales ($M)": 194,
            "Net Income ($M)": 47,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 86,
            "Company": "Jiayou International Logistics",
            "Country/Territory": "China",
            "Industry": "Transportation",
            "Sales ($M)": 984,
            "Net Income ($M)": 147,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 87,
            "Company": "Jin Yang Pharmaceutical",
            "Country/Territory": "South Korea",
            "Industry": "Pharmaceuticals",
            "Sales ($M)": 72,
            "Net Income ($M)": 10,
            "Market Value ($M)": 500,
            "year": 2024
        },
        {
            "Rank": 88,
            "Company": "Jinzai Food Group",
            "Country/Territory": "China",
            "Industry": "Food & Beverage",
            "Sales ($M)": 290,
            "Net Income ($M)": 30,
            "Market Value ($M)": 500,
            "year": 2024
        },
        {
            "Rank": 89,
            "Company": "Jupiter Wagons",
            "Country/Territory": "India",
            "Industry": "Industrial Machinery",
            "Sales ($M)": 440,
            "Net Income ($M)": 40,
            "Market Value ($M)": 25000,
            "year": 2024
        },
        {
            "Rank": 90,
            "Company": "Jyothy Labs",
            "Country/Territory": "India",
            "Industry": "Household & Personal Products",
            "Sales ($M)": 334,
            "Net Income ($M)": 45,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 91,
            "Company": "JYP Entertainment",
            "Country/Territory": "South Korea",
            "Industry": "Media & Entertainment",
            "Sales ($M)": 434,
            "Net Income ($M)": 81,
            "Market Value ($M)": 20000,
            "year": 2024
        },
        {
            "Rank": 92,
            "Company": "Karmarts",
            "Country/Territory": "Thailand",
            "Industry": "Personal Products",
            "Sales ($M)": 70,
            "Net Income ($M)": 19,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 93,
            "Company": "KeePer Technical Laboratory",
            "Country/Territory": "Japan",
            "Industry": "Commercial Services",
            "Sales ($M)": 124,
            "Net Income ($M)": 29,
            "Market Value ($M)": null,
            "year": 2024
        },
        {
            "Rank": 94,
            "Company": "Kewal Kiran Clothing",
            "Country/Territory": "India",
            "Industry": "Apparel",
            "Sales ($M)": 104,
            "Net Income ($M)": 19,
            "Market Value ($M)": 15000,
            "year": 2024
        },
        {
            "Rank": 95,
            "Company": "K.P. Energy",
            "Country/Territory": "India",
            "Industry": "Renewable Energy",
            "Sales ($M)": 57,
            "Net Income ($M)": 7,
            "Market Value ($M)": 400,
            "year": 2024
        },
        {
            "Rank": 96,
            "Company": "KPIT Technologies",
            "Country/Territory": "India",
            "Industry": "Software & Services",
            "Sales ($M)": 588,
            "Net Income ($M)": 77,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 97,
            "Company": "LaserBond",
            "Country/Territory": "Australia",
            "Industry": "Industrial Machinery",
            "Sales ($M)": 26,
            "Net Income ($M)": 3,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 98,
            "Company": "Lycopodium",
            "Country/Territory": "Australia",
            "Industry": "Construction & Engineering",
            "Sales ($M)": 218,
            "Net Income ($M)": 31,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 99,
            "Company": "M31 Technology",
            "Country/Territory": "Taiwan",
            "Industry": "Semiconductors",
            "Sales ($M)": 52,
            "Net Income ($M)": 14,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 100,
            "Company": "Fanuc",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 6000,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 40000,
            "year": 2024
        },
        {
            "Rank": 101,
            "Company": "Far EasTone Telecommunications",
            "Country/Territory": "Taiwan",
            "Industry": "Telecommunications",
            "Sales ($M)": 3000,
            "Net Income ($M)": 300,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 102,
            "Company": "Fast Retailing",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 20000,
            "Net Income ($M)": 2000,
            "Market Value ($M)": 70000,
            "year": 2024
        },
        {
            "Rank": 103,
            "Company": "F-Code",
            "Country/Territory": "Japan",
            "Industry": "IT Services",
            "Sales ($M)": 20,
            "Net Income ($M)": 5,
            "Market Value ($M)": 100,
            "year": 2024
        },
        {
            "Rank": 104,
            "Company": "FDK",
            "Country/Territory": "Japan",
            "Industry": "Electronics",
            "Sales ($M)": 600,
            "Net Income ($M)": 10,
            "Market Value ($M)": 200,
            "year": 2024
        },
        {
            "Rank": 105,
            "Company": "Ferrotec Holdings",
            "Country/Territory": "Japan",
            "Industry": "Semiconductors",
            "Sales ($M)": 1500,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 106,
            "Company": "Fila Holdings",
            "Country/Territory": "South Korea",
            "Industry": "Apparel",
            "Sales ($M)": 3000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 107,
            "Company": "First Gen",
            "Country/Territory": "Philippines",
            "Industry": "Utilities",
            "Sales ($M)": 2000,
            "Net Income ($M)": 250,
            "Market Value ($M)": 1000,
            "year": 2024
        },
        {
            "Rank": 108,
            "Company": "Fisco",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 50,
            "Net Income ($M)": 10,
            "Market Value ($M)": 150,
            "year": 2024
        },
        {
            "Rank": 109,
            "Company": "Fossil Group",
            "Country/Territory": "Hong Kong",
            "Industry": "Consumer Goods",
            "Sales ($M)": 1500,
            "Net Income ($M)": -100,
            "Market Value ($M)": 200,
            "year": 2024
        },
        {
            "Rank": 110,
            "Company": "Foster Electric",
            "Country/Territory": "Japan",
            "Industry": "Electronics",
            "Sales ($M)": 1000,
            "Net Income ($M)": 20,
            "Market Value ($M)": 300,
            "year": 2024
        },
        {
            "Rank": 111,
            "Company": "Fubon Financial Holding",
            "Country/Territory": "Taiwan",
            "Industry": "Finance",
            "Sales ($M)": 20000,
            "Net Income ($M)": 2000,
            "Market Value ($M)": 25000,
            "year": 2024
        },
        {
            "Rank": 112,
            "Company": "Fuji Electric",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 8000,
            "Net Income ($M)": 400,
            "Market Value ($M)": 6000,
            "year": 2024
        },
        {
            "Rank": 113,
            "Company": "Fuji Heavy Industries",
            "Country/Territory": "Japan",
            "Industry": "Automotive",
            "Sales ($M)": 30000,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 20000,
            "year": 2024
        },
        {
            "Rank": 114,
            "Company": "Fuji Media Holdings",
            "Country/Territory": "Japan",
            "Industry": "Media",
            "Sales ($M)": 5000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 3000,
            "year": 2024
        },
        {
            "Rank": 115,
            "Company": "Fujifilm Holdings",
            "Country/Territory": "Japan",
            "Industry": "Technology",
            "Sales ($M)": 22000,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 30000,
            "year": 2024
        },
        {
            "Rank": 116,
            "Company": "Fujikura",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 6000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 117,
            "Company": "Fujitsu",
            "Country/Territory": "Japan",
            "Industry": "IT Services",
            "Sales ($M)": 35000,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 25000,
            "year": 2024
        },
        {
            "Rank": 118,
            "Company": "Fukuda Denshi",
            "Country/Territory": "Japan",
            "Industry": "Healthcare",
            "Sales ($M)": 1200,
            "Net Income ($M)": 100,
            "Market Value ($M)": 1000,
            "year": 2024
        },
        {
            "Rank": 119,
            "Company": "Fukuoka Financial Group",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 3000,
            "Net Income ($M)": 500,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 120,
            "Company": "Fullcast Holdings",
            "Country/Territory": "Japan",
            "Industry": "Services",
            "Sales ($M)": 400,
            "Net Income ($M)": 30,
            "Market Value ($M)": 300,
            "year": 2024
        },
        {
            "Rank": 121,
            "Company": "Funai Electric",
            "Country/Territory": "Japan",
            "Industry": "Electronics",
            "Sales ($M)": 1000,
            "Net Income ($M)": -50,
            "Market Value ($M)": 100,
            "year": 2024
        },
        {
            "Rank": 122,
            "Company": "Furukawa Electric",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 8000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 123,
            "Company": "Fuso Chemical",
            "Country/Territory": "Japan",
            "Industry": "Chemicals",
            "Sales ($M)": 400,
            "Net Income ($M)": 50,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 124,
            "Company": "Futaba Industrial",
            "Country/Territory": "Japan",
            "Industry": "Automotive",
            "Sales ($M)": 2500,
            "Net Income ($M)": 50,
            "Market Value ($M)": 400,
            "year": 2024
        },
        {
            "Rank": 125,
            "Company": "Gakken Holdings",
            "Country/Territory": "Japan",
            "Industry": "Publishing",
            "Sales ($M)": 1500,
            "Net Income ($M)": 50,
            "Market Value ($M)": 500,
            "year": 2024
        },
        {
            "Rank": 126,
            "Company": "Gelex",
            "Country/Territory": "Vietnam",
            "Industry": "Manufacturing",
            "Sales ($M)": 1300,
            "Net Income ($M)": 50,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 127,
            "Company": "General Packer",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 100,
            "Net Income ($M)": 10,
            "Market Value ($M)": 150,
            "year": 2024
        },
        {
            "Rank": 128,
            "Company": "Genky DrugStores",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 1500,
            "Net Income ($M)": 50,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 129,
            "Company": "Genting Singapore",
            "Country/Territory": "Singapore",
            "Industry": "Gaming",
            "Sales ($M)": 1700,
            "Net Income ($M)": 250,
            "Market Value ($M)": 7000,
            "year": 2024
        },
        {
            "Rank": 130,
            "Company": "G-Foot",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 800,
            "Net Income ($M)": -20,
            "Market Value ($M)": 100,
            "year": 2024
        },
        {
            "Rank": 131,
            "Company": "Giga-Tronics",
            "Country/Territory": "Taiwan",
            "Industry": "Electronics",
            "Sales ($M)": 50,
            "Net Income ($M)": 10,
            "Market Value ($M)": 100,
            "year": 2024
        },
        {
            "Rank": 132,
            "Company": "Giken",
            "Country/Territory": "Japan",
            "Industry": "Construction",
            "Sales ($M)": 300,
            "Net Income ($M)": 30,
            "Market Value ($M)": 500,
            "year": 2024
        },
        {
            "Rank": 133,
            "Company": "GMO Payment Gateway",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 400,
            "Net Income ($M)": 100,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 134,
            "Company": "Goldwin",
            "Country/Territory": "Japan",
            "Industry": "Apparel",
            "Sales ($M)": 900,
            "Net Income ($M)": 100,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 135,
            "Company": "Goodman Fielder",
            "Country/Territory": "Australia",
            "Industry": "Food &amp; Beverage",
            "Sales ($M)": 1800,
            "Net Income ($M)": 50,
            "Market Value ($M)": 1000,
            "year": 2024
        },
        {
            "Rank": 136,
            "Company": "Gree",
            "Country/Territory": "Japan",
            "Industry": "Gaming",
            "Sales ($M)": 600,
            "Net Income ($M)": 100,
            "Market Value ($M)": 1000,
            "year": 2024
        },
        {
            "Rank": 137,
            "Company": "GSI Creos",
            "Country/Territory": "Japan",
            "Industry": "Trading",
            "Sales ($M)": 1500,
            "Net Income ($M)": 50,
            "Market Value ($M)": 300,
            "year": 2024
        },
        {
            "Rank": 138,
            "Company": "G-Tekt",
            "Country/Territory": "Japan",
            "Industry": "Automotive",
            "Sales ($M)": 2500,
            "Net Income ($M)": 100,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 139,
            "Company": "Gulliver International",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 3000,
            "Net Income ($M)": 100,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 140,
            "Company": "Gunma Bank",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 1500,
            "Net Income ($M)": 300,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 141,
            "Company": "Gunze",
            "Country/Territory": "Japan",
            "Industry": "Apparel",
            "Sales ($M)": 1200,
            "Net Income ($M)": 50,
            "Market Value ($M)": 500,
            "year": 2024
        },
        {
            "Rank": 142,
            "Company": "H2O Retailing",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 7000,
            "Net Income ($M)": 100,
            "Market Value ($M)": 1500,
            "year": 2024
        },
        {
            "Rank": 143,
            "Company": "Hachijuni Bank",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 2000,
            "Net Income ($M)": 300,
            "Market Value ($M)": 3000,
            "year": 2024
        },
        {
            "Rank": 144,
            "Company": "Hakuhodo DY Holdings",
            "Country/Territory": "Japan",
            "Industry": "Media",
            "Sales ($M)": 8000,
            "Net Income ($M)": 300,
            "Market Value ($M)": 4000,
            "year": 2024
        },
        {
            "Rank": 145,
            "Company": "Hamamatsu Photonics",
            "Country/Territory": "Japan",
            "Industry": "Electronics",
            "Sales ($M)": 1800,
            "Net Income ($M)": 300,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 146,
            "Company": "Hankyu Hanshin Holdings",
            "Country/Territory": "Japan",
            "Industry": "Transportation",
            "Sales ($M)": 8000,
            "Net Income ($M)": 500,
            "Market Value ($M)": 10000,
            "year": 2024
        },
        {
            "Rank": 147,
            "Company": "Hanshin Electric Railway",
            "Country/Territory": "Japan",
            "Industry": "Transportation",
            "Sales ($M)": 1500,
            "Net Income ($M)": 100,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 148,
            "Company": "Haseko",
            "Country/Territory": "Japan",
            "Industry": "Construction",
            "Sales ($M)": 8000,
            "Net Income ($M)": 500,
            "Market Value ($M)": 4000,
            "year": 2024
        },
        {
            "Rank": 149,
            "Company": "Heiwa",
            "Country/Territory": "Japan",
            "Industry": "Gaming",
            "Sales ($M)": 1200,
            "Net Income ($M)": 150,
            "Market Value ($M)": 1500,
            "year": 2024
        },
        {
            "Rank": 150,
            "Company": "Heiwado",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 4000,
            "Net Income ($M)": 100,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 151,
            "Company": "Hibiya Engineering",
            "Country/Territory": "Japan",
            "Industry": "Construction",
            "Sales ($M)": 500,
            "Net Income ($M)": 30,
            "Market Value ($M)": 300,
            "year": 2024
        },
        {
            "Rank": 152,
            "Company": "Hikari Tsushin",
            "Country/Territory": "Japan",
            "Industry": "IT Services",
            "Sales ($M)": 5000,
            "Net Income ($M)": 500,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 153,
            "Company": "Hino Motors",
            "Country/Territory": "Japan",
            "Industry": "Automotive",
            "Sales ($M)": 15000,
            "Net Income ($M)": -500,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 154,
            "Company": "Hirose Electric",
            "Country/Territory": "Japan",
            "Industry": "Electronics",
            "Sales ($M)": 1500,
            "Net Income ($M)": 250,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 155,
            "Company": "Hisamitsu Pharmaceutical",
            "Country/Territory": "Japan",
            "Industry": "Healthcare",
            "Sales ($M)": 1200,
            "Net Income ($M)": 150,
            "Market Value ($M)": 4000,
            "year": 2024
        },
        {
            "Rank": 156,
            "Company": "Hitachi",
            "Country/Territory": "Japan",
            "Industry": "Conglomerate",
            "Sales ($M)": 90000,
            "Net Income ($M)": 3000,
            "Market Value ($M)": 50000,
            "year": 2024
        },
        {
            "Rank": 157,
            "Company": "Hitachi Construction Machinery",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 9000,
            "Net Income ($M)": 400,
            "Market Value ($M)": 6000,
            "year": 2024
        },
        {
            "Rank": 158,
            "Company": "Hitachi High-Technologies",
            "Country/Territory": "Japan",
            "Industry": "Technology",
            "Sales ($M)": 6000,
            "Net Income ($M)": 300,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 159,
            "Company": "Hitachi Metals",
            "Country/Territory": "Japan",
            "Industry": "Metals",
            "Sales ($M)": 8000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 4000,
            "year": 2024
        },
        {
            "Rank": 160,
            "Company": "Hogy Medical",
            "Country/Territory": "Japan",
            "Industry": "Healthcare",
            "Sales ($M)": 300,
            "Net Income ($M)": 50,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 161,
            "Company": "Hokkaido Electric Power",
            "Country/Territory": "Japan",
            "Industry": "Utilities",
            "Sales ($M)": 6000,
            "Net Income ($M)": -200,
            "Market Value ($M)": 1500,
            "year": 2024
        },
        {
            "Rank": 162,
            "Company": "Hokuetsu",
            "Country/Territory": "Japan",
            "Industry": "Paper",
            "Sales ($M)": 2500,
            "Net Income ($M)": 100,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 163,
            "Company": "Hokuriku Electric Power",
            "Country/Territory": "Japan",
            "Industry": "Utilities",
            "Sales ($M)": 5000,
            "Net Income ($M)": -100,
            "Market Value ($M)": 1000,
            "year": 2024
        },
        {
            "Rank": 164,
            "Company": "Honda Motor",
            "Country/Territory": "Japan",
            "Industry": "Automotive",
            "Sales ($M)": 130000,
            "Net Income ($M)": 5000,
            "Market Value ($M)": 50000,
            "year": 2024
        },
        {
            "Rank": 165,
            "Company": "Hon Hai Precision Industry",
            "Country/Territory": "Taiwan",
            "Industry": "Electronics",
            "Sales ($M)": 200000,
            "Net Income ($M)": 5000,
            "Market Value ($M)": 50000,
            "year": 2024
        },
        {
            "Rank": 166,
            "Company": "Horiba",
            "Country/Territory": "Japan",
            "Industry": "Technology",
            "Sales ($M)": 2000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 4000,
            "year": 2024
        },
        {
            "Rank": 167,
            "Company": "Hoshizaki",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 2500,
            "Net Income ($M)": 200,
            "Market Value ($M)": 6000,
            "year": 2024
        },
        {
            "Rank": 168,
            "Company": "House Foods Group",
            "Country/Territory": "Japan",
            "Industry": "Food &amp; Beverage",
            "Sales ($M)": 2500,
            "Net Income ($M)": 100,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 169,
            "Company": "Hoya",
            "Country/Territory": "Japan",
            "Industry": "Healthcare",
            "Sales ($M)": 5500,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 40000,
            "year": 2024
        },
        {
            "Rank": 170,
            "Company": "Hulic",
            "Country/Territory": "Japan",
            "Industry": "Real Estate",
            "Sales ($M)": 3000,
            "Net Income ($M)": 500,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 171,
            "Company": "Hyundai Department Store",
            "Country/Territory": "South Korea",
            "Industry": "Retail",
            "Sales ($M)": 6000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 172,
            "Company": "Hyundai Glovis",
            "Country/Territory": "South Korea",
            "Industry": "Logistics",
            "Sales ($M)": 20000,
            "Net Income ($M)": 500,
            "Market Value ($M)": 6000,
            "year": 2024
        },
        {
            "Rank": 173,
            "Company": "Hyundai Mobis",
            "Country/Territory": "South Korea",
            "Industry": "Automotive",
            "Sales ($M)": 40000,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 18000,
            "year": 2024
        },
        {
            "Rank": 174,
            "Company": "Hyundai Motor",
            "Country/Territory": "South Korea",
            "Industry": "Automotive",
            "Sales ($M)": 120000,
            "Net Income ($M)": 5000,
            "Market Value ($M)": 40000,
            "year": 2024
        },
        {
            "Rank": 175,
            "Company": "Ibiden",
            "Country/Territory": "Japan",
            "Industry": "Electronics",
            "Sales ($M)": 3000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 4000,
            "year": 2024
        },
        {
            "Rank": 176,
            "Company": "Ichibanya",
            "Country/Territory": "Japan",
            "Industry": "Food &amp; Beverage",
            "Sales ($M)": 450,
            "Net Income ($M)": 30,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 177,
            "Company": "Idemitsu Kosan",
            "Country/Territory": "Japan",
            "Industry": "Energy",
            "Sales ($M)": 60000,
            "Net Income ($M)": 1500,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 178,
            "Company": "IHI",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 12000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 3000,
            "year": 2024
        },
        {
            "Rank": 179,
            "Company": "Iida Group Holdings",
            "Country/Territory": "Japan",
            "Industry": "Construction",
            "Sales ($M)": 12000,
            "Net Income ($M)": 800,
            "Market Value ($M)": 6000,
            "year": 2024
        },
        {
            "Rank": 180,
            "Company": "Iino Kaiun Kaisha",
            "Country/Territory": "Japan",
            "Industry": "Shipping",
            "Sales ($M)": 1000,
            "Net Income ($M)": 100,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 181,
            "Company": "I-Net",
            "Country/Territory": "Japan",
            "Industry": "IT Services",
            "Sales ($M)": 300,
            "Net Income ($M)": 20,
            "Market Value ($M)": 250,
            "year": 2024
        },
        {
            "Rank": 182,
            "Company": "Inpex",
            "Country/Territory": "Japan",
            "Industry": "Energy",
            "Sales ($M)": 15000,
            "Net Income ($M)": 3000,
            "Market Value ($M)": 15000,
            "year": 2024
        },
        {
            "Rank": 183,
            "Company": "Inter Action",
            "Country/Territory": "Japan",
            "Industry": "Manufacturing",
            "Sales ($M)": 100,
            "Net Income ($M)": 15,
            "Market Value ($M)": 150,
            "year": 2024
        },
        {
            "Rank": 184,
            "Company": "Invoclar Vivadent",
            "Country/Territory": "Liechtenstein",
            "Industry": "Healthcare",
            "Sales ($M)": 800,
            "Net Income ($M)": 100,
            "Market Value ($M)": null,
            "year": 2024
        },
        {
            "Rank": 185,
            "Company": "Isetan Mitsukoshi Holdings",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 10000,
            "Net Income ($M)": 100,
            "Market Value ($M)": 3000,
            "year": 2024
        },
        {
            "Rank": 186,
            "Company": "Ishihara Sangyo Kaisha",
            "Country/Territory": "Japan",
            "Industry": "Chemicals",
            "Sales ($M)": 1000,
            "Net Income ($M)": 50,
            "Market Value ($M)": 400,
            "year": 2024
        },
        {
            "Rank": 187,
            "Company": "Isuzu Motors",
            "Country/Territory": "Japan",
            "Industry": "Automotive",
            "Sales ($M)": 20000,
            "Net Income ($M)": 800,
            "Market Value ($M)": 8000,
            "year": 2024
        },
        {
            "Rank": 188,
            "Company": "Ito En",
            "Country/Territory": "Japan",
            "Industry": "Food &amp; Beverage",
            "Sales ($M)": 4000,
            "Net Income ($M)": 150,
            "Market Value ($M)": 3000,
            "year": 2024
        },
        {
            "Rank": 189,
            "Company": "Itochu",
            "Country/Territory": "Japan",
            "Industry": "Trading",
            "Sales ($M)": 100000,
            "Net Income ($M)": 5000,
            "Market Value ($M)": 40000,
            "year": 2024
        },
        {
            "Rank": 190,
            "Company": "Itoham Yonekyu Holdings",
            "Country/Territory": "Japan",
            "Industry": "Food &amp; Beverage",
            "Sales ($M)": 8000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2000,
            "year": 2024
        },
        {
            "Rank": 191,
            "Company": "Iwatani",
            "Country/Territory": "Japan",
            "Industry": "Energy",
            "Sales ($M)": 6000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 192,
            "Company": "Izumi",
            "Country/Territory": "Japan",
            "Industry": "Retail",
            "Sales ($M)": 7000,
            "Net Income ($M)": 200,
            "Market Value ($M)": 2500,
            "year": 2024
        },
        {
            "Rank": 193,
            "Company": "Jaccs",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 1200,
            "Net Income ($M)": 100,
            "Market Value ($M)": 800,
            "year": 2024
        },
        {
            "Rank": 194,
            "Company": "Jafco Group",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 200,
            "Net Income ($M)": 100,
            "Market Value ($M)": 1500,
            "year": 2024
        },
        {
            "Rank": 195,
            "Company": "Japan Airlines",
            "Country/Territory": "Japan",
            "Industry": "Aviation",
            "Sales ($M)": 12000,
            "Net Income ($M)": -300,
            "Market Value ($M)": 5000,
            "year": 2024
        },
        {
            "Rank": 196,
            "Company": "Japan Airport Terminal",
            "Country/Territory": "Japan",
            "Industry": "Transportation",
            "Sales ($M)": 2000,
            "Net Income ($M)": -200,
            "Market Value ($M)": 3000,
            "year": 2024
        },
        {
            "Rank": 197,
            "Company": "Japan Exchange Group",
            "Country/Territory": "Japan",
            "Industry": "Finance",
            "Sales ($M)": 1200,
            "Net Income ($M)": 500,
            "Market Value ($M)": 10000,
            "year": 2024
        },
        {
            "Rank": 198,
            "Company": "Japan Lifeline",
            "Country/Territory": "Japan",
            "Industry": "Healthcare",
            "Sales ($M)": 400,
            "Net Income ($M)": 80,
            "Market Value ($M)": 1500,
            "year": 2024
        },
        {
            "Rank": 199,
            "Company": "Japan Post Holdings",
            "Country/Territory": "Japan",
            "Industry": "Conglomerate",
            "Sales ($M)": 100000,
            "Net Income ($M)": 3000,
            "Market Value ($M)": 30000,
            "year": 2024
        },
        {
            "Rank": 200,
            "Company": "Japan Tobacco",
            "Country/Territory": "Japan",
            "Industry": "Tobacco",
            "Sales ($M)": 20000,
            "Net Income ($M)": 3000,
            "Market Value ($M)": 35000,
            "year": 2024
        }
    ]
}